<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="A blog of roylee，一个半路出家的iOS Coder的技术之路">
    <meta name="keyword"  content="Personal blog，iOS，Developer，Coder，博客，iOS开发，技术">
    <link rel="shortcut icon" href="/Roylee-ML.github.io/img/favicon.ico">

    <title>
        
          从汽车修理工到iOS开发 - Roylee Blog From A iOS Developer
        
    </title>

    <link rel="canonical" href="http://error408.com/Roylee-ML.github.io/2016/07/05/我的iOS开发之路/">

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/bootstrap.min.css">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/hux-blog.min.css">

    <!-- Pygments Github CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/syntax.css">

    <!-- Custom Fonts -->
    <!-- <link href="http://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="http://cdn.staticfile.org/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>

    <meta name="baidu-site-verification" content="zeyFn1s9OY" />
</head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/Roylee-ML.github.io/">Roylee&#39;s Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/Roylee-ML.github.io/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/tags/">Tags</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('http://blogsrc.error408.com/hexoblog/images/base/info-bg.jpg')
    }
</style>
<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                          <a class="tag" href="/Roylee-ML.github.io/tags/#iOS开发" title="iOS开发">iOS开发</a>
                        
                    </div>
                    <h1>从汽车修理工到iOS开发</h1>
                    <h2 class="subheading"></h2>
                    <span class="meta">
                        Posted by Roylee on
                        2016-07-05
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <p>&#x4ECE;&#x4E8B;iOS&#x5F00;&#x53D1;&#x5FEB;&#x4E00;&#x5E74;&#x4E86;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x81EA;&#x5DF1;&#x7ADF;&#x7136;&#x8D70;&#x4E0A;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x8FD9;&#x6761;&#x4E0D;&#x5F52;&#x8DEF;&#x4E86;&#x3002;&#x60F3;&#x60F3;&#x8FD8;&#x662F;&#x86EE;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;</p>
<p><br><br><strong> &#x534A;&#x4E2A;&#x673A;&#x68B0;&#x5E08; </strong></p>
<p>&#x56DE;&#x5230;&#x4E00;&#x5E74;&#x4EE5;&#x524D;&#xFF0C;&#x6C7D;&#x8F66;&#x4FEE;&#x7406;&#x8F66;&#x95F4;&#x4E2D;&#x8FD8;&#x80FD;&#x770B;&#x89C1;&#x6211;&#x8FD9;&#x4E2A;&#x7626;&#x5F31;&#x7684;&#x8EAB;&#x5F71;&#x3002;&#x5982;&#x679C;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x5C4C;&#x4E1D;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x65F6;&#x7684;&#x81EA;&#x5DF1;&#x771F;&#x5B9E;&#x8D85;&#x7EA7;&#x5C4C;&#x4E1D;&#x554A;&#x3002;&#x524D;&#x4E0D;&#x4E45;&#xFF0C;&#x4EE5;&#x524D;&#x4E00;&#x5757;&#x4FEE;&#x8F66;&#x7684;&#x670B;&#x53CB;&#x53D1;&#x6765;&#x4E00;&#x5F20;&#x5077;&#x62CD;&#x7684;&#x6211;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x6211;&#x7684;&#x4E2A;&#x5A18;&#xFF0C;&#x90A3;&#x9ED1;&#x7626;&#x7684;&#x4FE8;&#x7136;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x8001;&#x5934;&#x561B;&#xFF0C;&#x770B;&#x7740;&#x90FD;&#x89C9;&#x5F97;&#x597D;&#x7B11;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x773C;&#x91CC;&#xFF0C;&#x4FEE;&#x8F66;&#x662F;&#x4EF6;&#x8F9B;&#x82E6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x867D;&#x7136;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4E5F;&#x5F88;&#x5FD9;&#xFF0C;&#x53CC;&#x624B;&#x7684;&#x6CB9;&#x6E0D;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x6D17;&#x4E0D;&#x6389;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5374;&#x4E0D;&#x662F;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x8F6C;&#x884C;&#x4ECE;&#x4E8B;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x90A3;&#x540E;&#x6765;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x505A;&#x5F00;&#x53D1;&#x4E86;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#xFF0C;&#x60F3;&#x8981;&#x66F4;&#x597D;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6709;&#x70B9;&#x60F3;&#x6CD5;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x4E0D;&#x662F;&#x7518;&#x4E8E;&#x843D;&#x5BDE;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x662F;&#x60F3;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x53D1;&#x6325;&#x66F4;&#x5927;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x53BB;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x8FFD;&#x6C42;&#x7684;&#x4EBA;&#xFF08;&#x597D;&#x50CF;&#x6709;&#x70B9;&#x9E21;&#x6C64;&#x554A;&#xFF0C;&#x5475;&#x5475;&#xFF09;&#x3002;&#x800C;&#x6211;&#xFF0C;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF08;&#x771F;&#x662F;&#x5E9F;&#x8BDD;~~&#xFF09;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x6211;&#x5F00;&#x59CB;&#x9009;&#x62E9;&#x4FEE;&#x8F66;&#x884C;&#x4E1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x505A;&#x597D;&#x4E86;&#x6253;&#x7B97;&#xFF1A;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x5B66;&#x5386;&#xFF0C;&#x5C31;&#x5148;&#x4ECE;&#x5B66;&#x5F92;&#x5F00;&#x59CB;&#xFF0C;&#x8FB9;&#x5E72;&#x8FB9;&#x5B66;&#xFF1B;&#x7136;&#x540E;&#xFF0C;&#x53BB;&#x9AD8;&#x7AEF;&#x7684;&#x5730;&#x65B9;&#x4ECE;&#x4E8B;&#x9AD8;&#x7AEF;&#x8F66;&#x7684;&#x5DE5;&#x4F5C;&#xFF1B;&#x6700;&#x540E;&#xFF0C;&#x8FDB;&#x5165;4S&#x5E97;&#x3002;&#x867D;&#x7136;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5E76;&#x4E0D;&#x770B;&#x597D;&#x6211;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x575A;&#x6301;&#x4E0B;&#x6765;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E00;&#x5E74;&#x591A;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x8D1F;&#x8D23;&#x9AD8;&#x7AEF;&#x8F66;&#x7684;&#x4FEE;&#x7406;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x81EA;&#x5DF1;&#x5E76;&#x4E0D;&#x6EE1;&#x8DB3;&#x4E8E;&#x5728;&#x4E00;&#x4E2A;&#x4FEE;&#x7406;&#x5382;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x53BB;&#x66F4;&#x4E13;&#x4E1A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x90A3;&#x91CC;&#x624D;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x7CBE;&#x8FDB;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x540C;&#x65F6;&#x63A5;&#x89E6;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x4E3A;&#x81EA;&#x5DF1;&#x5C06;&#x6765;&#x505A;&#x94FA;&#x57AB;&#x3002;</p>
<p><br><br><strong> &#x4F60;&#x53BB;&#x641E;&#x5F00;&#x53D1;&#x5427; </strong></p>
<p>&#x7136;&#x800C;&#xFF0C;&#x4E8B;&#x60C5;&#x5E76;&#x4E0D;&#x4F1A;&#x603B;&#x662F;&#x6309;&#x7167;&#x4EBA;&#x4EEC;&#x7684;&#x610F;&#x613F;&#x53D1;&#x5C55;&#x3002;&#x5728;&#x90A3;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x6574;&#x4E2A;&#x884C;&#x4E1A;&#x4E5F;&#x5E76;&#x4E0D;&#x5341;&#x5206;&#x666F;&#x6C14;&#xFF0C;4S&#x5E97;&#x7684;&#x62DB;&#x4EBA;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#x3002;&#x5C24;&#x5176;&#x662F;&#x6211;&#x8FD9;&#x6837;&#x6CA1;&#x6709;&#x5B66;&#x5386;&#x7684;&#xFF08;4S&#x5E97;&#x5BF9;&#x5B66;&#x5386;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x8981;&#x6C42;&#x7684;&#xFF0C;&#x540C;&#x6837;&#x6280;&#x672F;&#x751A;&#x81F3;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x5B66;&#x5386;&#x5374;&#x9AD8;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x57F9;&#x8BAD;&#x664B;&#x5347;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x540E;&#x8005;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x5E2E;&#x6211;&#x4ECB;&#x7ECD;4S&#x5E97;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684;&#x5730;&#x65B9;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x53BB;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x5230;&#x4E86;&#x90A3;&#x5E74;&#x7684;&#x5E74;&#x5E95;&#x3002;&#x56DE;&#x5230;&#x8001;&#x5BB6;&#xFF0C;&#x4E00;&#x684C;&#x670B;&#x53CB;&#x4E00;&#x5757;&#x5403;&#x996D;&#xFF0C;&#x804A;&#x5929;&#xFF0C;&#x6700;&#x540E;&#x8BF4;&#x5230;&#x8FD9;&#x4E2A;&#x4E8B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x670B;&#x53CB;&#x4E5F;&#x5F88;&#x662F;&#x611F;&#x6168;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F53;&#x7136;&#x5E0C;&#x671B;&#x6211;&#x80FD;&#x6709;&#x66F4;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x5EFA;&#x8BAE;&#x8BA9;&#x6211;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x89C4;&#x5212; &#x2014;&#x2014; &#x201C;&#x4F60;&#x53BB;&#x641E;&#x5F00;&#x53D1;&#x5427;&#x201D;&#x3002;</p>
<p><br><br><strong> &#x4ECE;&#x96F6;&#x5F00;&#x59CB; </strong></p>
<p>&#x6700;&#x521D;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x60F3;&#x6CD5;&#x60F3;&#x8981;&#x81EA;&#x5B66;&#xFF0C;&#x540E;&#x6765;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x81EA;&#x77E5;&#x7684;&#x653E;&#x5F03;&#x4E86;&#x81EA;&#x5B66;&#x3002;&#x4E00;&#x662F;&#xFF0C;&#x81EA;&#x5DF1;&#x4E00;&#x70B9;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x57FA;&#x7840;&#x90FD;&#x6CA1;&#x6709;&#xFF1B;&#x4E8C;&#x6765;&#xFF0C;&#x81EA;&#x5B66;&#x7684;&#x6548;&#x7387;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x4F4E;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x5168;&#x804C;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x95F4;&#x7CBE;&#x529B;&#x6295;&#x5165;&#x5927;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD8;&#x662F;&#x53BB;&#x627E;&#x4E2A;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x5427;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x5E1D;&#x90FD;&#x7684;&#x4E00;&#x4E2A;&#x84DD;&#x8272;&#x5C0F;&#x9E1F;&#x7684;&#x673A;&#x6784;&#x5F00;&#x59CB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7F16;&#x7A0B;&#x5B66;&#x4E60;&#x4E4B;&#x8DEF;&#x3002;&#x6B63;&#x5982;&#x4E00;&#x5F00;&#x59CB;&#x9884;&#x6599;&#x7684;&#xFF0C;&#x5C3C;&#x739B;&#xFF0C;&#x5B66;&#x4E2A;&#x7F16;&#x7A0B;&#x8981;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x96BE;&#xFF1F;&#x4E00;&#x4E2A;C&#x8BED;&#x8A00;&#x8981;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x96BE;&#xFF1F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8981;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x96BE;&#xFF1F;&#x90A3;&#x662F;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x771F;&#x662F;&#x61F5;&#x903C;&#x7684;&#xFF0C;&#x611F;&#x89C9;&#x4EC0;&#x4E48;&#x90FD;&#x662F;&#x5403;&#x529B;&#x7684;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6BD4;&#x5927;&#x7269;&#x597D;&#x4E0D;&#x5230;&#x54EA;&#x53BB;&#xFF08;&#x4E5F;&#x8BB8;&#x53EA;&#x662F;&#x5BF9;&#x4E8E;&#x6211;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x95E8;&#x5916;&#x6C49;&#x5982;&#x6B64;&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x66F4;&#x5FEB;&#x7684;&#x638C;&#x63E1;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x9664;&#x4E86;&#x8BFE;&#x4E0A;&#x542C;&#x8001;&#x5E08;&#x7684;&#x8BB2;&#x8BFE;&#xFF0C;&#x81EA;&#x4E60;&#x5B8C;&#x6210;&#x4F5C;&#x4E1A;&#x5916;&#x3002;&#x6BCF;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x53C8;&#x5728;&#x56FE;&#x4E66;&#x9986;&#x501F;&#x4E86;&#x4E24;&#x672C;&#x4E66;&#xFF0C;&#x5373;&#x4FBF;&#x96BE;&#x61C2;&#xFF0C;&#x4F46;&#x4E5F;&#x662F;&#x5168;&#x90E8;&#x770B;&#x5B8C;&#x3002;&#x6BCF;&#x5929;&#x7684;&#x4F5C;&#x606F;&#x4E5F;&#x662F;&#x4E03;&#x70B9;&#x8D77;&#x5E8A;&#xFF0C;&#x51CC;&#x6668;&#x7761;&#x89C9;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x4E24;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x4E86;&#x4E24;&#x95E8;&#x8BED;&#x8A00;&#xFF08;C &amp; OC&#xFF09;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x60F3;&#x60F3;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x770B;&#x7684;&#x90A3;&#x4E9B;&#x4E66;&#x8D77;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x4E3A;&#x4EE5;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x8FD8;&#x6709;&#x5DE5;&#x4F5C;&#x6253;&#x4E0B;&#x4E86;&#x57FA;&#x7840;&#x3002;&#x63A5;&#x7740;&#x5C31;&#x662F;UI&#x3001;&#x9879;&#x76EE;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x505A;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x3001;&#x8BA4;&#x771F;&#x7684;&#x9879;&#x76EE;&#x662F;&#x5341;&#x5206;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x9047;&#x5230;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF0C;&#x4F1A;&#x9047;&#x5230;&#x5404;&#x79CD;&#x9700;&#x6C42;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4F1A;&#x9047;&#x5230;&#x5982;&#x4F55;&#x67E5;&#x627E;&#x95EE;&#x9898;&#x7B54;&#x6848;&#x641C;&#x96C6;&#x8D44;&#x6599;&#x7684;&#x95EE;&#x9898;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#xFF0C;&#x662F;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x7684;&#x57FA;&#x672C;&#x6280;&#x80FD;&#x3002;&#x4E5F;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x53BB;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x6280;&#x80FD;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x4E00;&#x70B9;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5BF9;&#x81EA;&#x5DF1;&#x8D1F;&#x8D23;&#xFF0C;&#x6700;&#x81EA;&#x5DF1;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x8D1F;&#x8D23;&#xFF0C;&#x80FD;&#x591F;&#x7CBE;&#x76CA;&#x6C42;&#x7CBE;&#x90A3;&#x5C31;&#x522B;&#x8BA9;&#x4ED6;&#x4E0D;&#x4F26;&#x4E0D;&#x7C7B;&#x5427;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x88AB;&#x4E92;&#x8054;&#x7F51;&#x7EA2;&#x5229;&#x5438;&#x5F15;&#x8FC7;&#x6765;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x4E00;&#x70B9;&#x8981;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#xFF0C;&#x597D;&#x597D;&#x7684;&#x78E8;&#x70BC;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x8BA4;&#x771F;&#x7684;&#x4EBA;&#x3002;</p>
<p><br><br><strong> &#x4E00;&#x5E74;&#x7684;&#x603B;&#x7ED3; </strong></p>
<p>&#x65F6;&#x95F4;&#x8FC7;&#x7684;&#x8FD8;&#x662F;&#x5F88;&#x5FEB;&#x7684;&#xFF0C;&#x8F6C;&#x773C;&#x4E4B;&#x95F4;&#xFF0C;&#x4E00;&#x5E74;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x8FC7;&#x53BB;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x7684;&#x81EA;&#x5DF1;&#x6280;&#x672F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x63D0;&#x9AD8;&#xFF0C;&#x4E5F;&#x5728;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x8BA9;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x5F88;low&#xFF0C;&#x61C2;&#x5F97;&#x4E1C;&#x897F;&#x3001;&#x4F1A;&#x7684;&#x4E1C;&#x897F;&#x771F;&#x662F;&#x592A;&#x5C11;&#x592A;&#x5C11;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x7F16;&#x7A0B;&#x7684;&#x6D77;&#x6D0B;&#x4E2D;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x5C31;&#x662F;&#x90A3;&#x6E3A;&#x5C0F;&#x7684;&#x6D6E;&#x6E38;&#x751F;&#x7269;&#x3002;&#x4E0D;&#x7BA1;&#x672A;&#x6765;&#x5982;&#x4F55;&#xFF0C;&#x8981;&#x53BB;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x544A;&#x8BEB;&#x81EA;&#x5DF1;&#xFF0C;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x53BB;&#x8D70;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x3002;&#x8BF4;&#x53E5;&#x9898;&#x5916;&#x7684;&#x8BDD;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x5E02;&#x573A;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x904D;&#x5730;&#x90FD;&#x662F;&#xFF0C;&#x5F88;&#x591A;&#x4E5F;&#x8DDF;&#x6211;&#x8FD9;&#x6837;&#xFF0C;&#x88AB;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8BF1;&#x60D1;&#x5438;&#x5F15;&#x4E86;&#x8FC7;&#x6765;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5927;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x7F16;&#x7A0B;&#x7684;&#x6D6A;&#x6F6E;&#x4E2D;&#xFF0C;&#x90A3;&#x4E9B;&#x5584;&#x4E8E;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3001;&#x5177;&#x6709;&#x94BB;&#x7814;&#x7CBE;&#x795E;&#x3001;&#x6280;&#x672F;&#x7CBE;&#x6E5B;&#x7684;&#x4EBA;&#x624D;&#x8FD8;&#x662F;&#x7545;&#x6E38;&#x65E0;&#x963B;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x521A;&#x5F00;&#x59CB;&#x4ECE;&#x4E8B;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#xFF0C;&#x6C89;&#x4F4F;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#xFF0C;&#x52AA;&#x529B;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x5427;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x6700;&#x597D;&#x7684;&#x5E74;&#x7EAA;&#x8352;&#x5E9F;&#x4E86;&#x9752;&#x6625;&#x3002;</p>


                <hr>

                

                <ul class="pager">
                    
                        <li class="previous">
                            <a href="/Roylee-ML.github.io/2016/07/14/SwipeTableView/" data-toggle="tooltip" data-placement="top" title="SwipeTableView">&larr; Previous Post</a>
                        </li>
                    
                    
                </ul>

                

                

            </div>
    <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/Roylee-ML.github.io/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/Roylee-ML.github.io/tags/#iOS开发" title="iOS开发">iOS开发</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="http://birdmichael.com/" target="_blank">BirdMichael&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>







<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("http://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;
            left: -0.75em;
            font-size: 1.1em;
            margin-top : -0.1em;
        }
    }
</style>




<!-- Gitalk 公共JS代码 start (一个网页只需插入一次) -->
    <link rel="stylesheet" href="https://unpkg.com/gitalk/dist/gitalk.css">
<div id="gitalk-container"></div>
<script src="https://unpkg.com/gitalk/dist/gitalk.min.js"></script>
<script type="text/javascript">
    var gitalk = new Gitalk({
        clientID: 'a09e7cc0e4b945f5e6d3',
        clientSecret: 'b99fba2d4ccc836f6ffb04e3194e96646b2bd11d',
        id: location.pathname,
        repo: 'blog-comments',
        owner: 'Roylee-ML',
        admin: 'Roylee-ML'
        distractionFreeMode: true
    })
    gitalk.render('gitalk-container')
</script>

<!-- Gitalk 公共JS代码 end -->



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/error408">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="https://www.facebook.com/roylee.stillway">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-facebook fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://github.com/Roylee-ML">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Roylee&#39;s Blog 2018 
                    <br>
                    Theme by <a href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a href="http://blog.kaijun.rocks">Kaijun</a> <!-- | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe> -->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->
<script src="/Roylee-ML.github.io/js/jquery.min.js"></script>

<!-- Bootstrap Core JavaScript -->
<script src="/Roylee-ML.github.io/js/bootstrap.min.js"></script>

<!-- Custom Theme JavaScript -->
<script src="/Roylee-ML.github.io/js/hux-blog.min.js"></script>


<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://error408.com/Roylee-ML.github.io/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '63fd5f0468edd7f1983edc897f814664';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->





<!-- Image to hack wechat -->
<img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0" />
<!-- Migrate from head to bottom, no longer block render and still work -->

</body>

</html>
