<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Roylee&#39;s Blog</title>
  <subtitle>To Be A Lean Developer!</subtitle>
  <link href="/roylee/atom.xml" rel="self"/>
  
  <link href="http://roylee.coding.me/"/>
  <updated>2016-07-15T01:22:05.000Z</updated>
  <id>http://roylee.coding.me/</id>
  
  <author>
    <name>孟亮</name>
    <email>roylee.stillway@gmail.com</email>
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>Hexo搭建</title>
    <link href="http://roylee.coding.me/2016/07/15/Hexo%E6%90%AD%E5%BB%BA/"/>
    <id>http://roylee.coding.me/2016/07/15/Hexo搭建/</id>
    <published>2016-07-15T01:22:05.000Z</published>
    <updated>2016-07-15T01:22:05.000Z</updated>
    
    <content type="html"></content>
    
    <summary type="html">
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>SwipeTableView</title>
    <link href="http://roylee.coding.me/2016/07/14/SwipeTableView/"/>
    <id>http://roylee.coding.me/2016/07/14/SwipeTableView/</id>
    <published>2016-07-14T09:31:11.000Z</published>
    <updated>2016-07-15T05:48:11.000Z</updated>
    
    <content type="html">&lt;p&gt;&lt;img src=&quot;/roylee/2016/07/14/SwipeTableView/logo.png&quot; alt=&quot;LOGO&quot;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x4F3C;&amp;#x534A;&amp;#x7CD6;&amp;#x9996;&amp;#x9875;&amp;#x3001;QQ&amp;#x97F3;&amp;#x4E50;&amp;#x5217;&amp;#x8868;&amp;#x3001;&amp;#x7F8E;&amp;#x4E3D;&amp;#x8BF4;&amp;#x9996;&amp;#x9875;&amp;#x3001;&amp;#x683C;&amp;#x74E6;&amp;#x65AF;&amp;#x7535;&amp;#x5F71;&amp;#x8BE6;&amp;#x60C5;&amp;#x9875;&amp;#xFF0C;&amp;#x65E2;&amp;#x80FD;&amp;#x4E0A;&amp;#x4E0B;&amp;#x6ED1;&amp;#x52A8;&amp;#xFF0C;&amp;#x540C;&amp;#x65F6;&amp;#x7528;&amp;#x80FD;&amp;#x5DE6;&amp;#x53F3;&amp;#x6ED1;&amp;#x52A8;&amp;#x7684;&amp;#x63A7;&amp;#x4EF6;&amp;#x3002;&amp;#x9879;&amp;#x76EE;&amp;#x5730;&amp;#x5740;&lt;a href=&quot;https://github.com/Roylee-ML/SwipeTableView&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;GitHub&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;br&gt;&lt;br&gt;&amp;#x8BF4;&amp;#x8D77;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x5F97;&amp;#x8C08;&amp;#x4E00;&amp;#x4E0B;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;&amp;#x5199;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#x7684;&amp;#x7F18;&amp;#x7531;&amp;#x3002;&amp;#x524D;&amp;#x4E00;&amp;#x9635;&amp;#x5B50;&amp;#xFF0C;&amp;#x516C;&amp;#x53F8;&amp;#x9879;&amp;#x76EE;&amp;#x9996;&amp;#x9875;&amp;#x6539;&amp;#x7248;&amp;#xFF0C;&amp;#x8981;&amp;#x6C42;&amp;#x4F5C;&amp;#x51FA;&amp;#x534A;&amp;#x7CD6;&amp;#x9996;&amp;#x9875;&amp;#x7684;&amp;#x6548;&amp;#x679C;&amp;#x3002;&amp;#x770B;&amp;#x4E86;&amp;#x4E00;&amp;#x773C;&amp;#x534A;&amp;#x7CD6;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x5FC3;&amp;#x4E2D;&amp;#x4E00;&amp;#x4E07;&amp;#x53EA;&amp;#x8349;&amp;#x6CE5;&amp;#x9A6C;&amp;#x5954;&amp;#x8FC7;&amp;#xFF0C;&amp;#x600E;&amp;#x4E48;&amp;#x4F1A;&amp;#x505A;&amp;#x8FD9;&amp;#x79CD;&amp;#x8BBE;&amp;#x8BA1;&amp;#xFF1F;&amp;#x540E;&amp;#x6765;&amp;#xFF0C;&amp;#x60F3;&amp;#x4E86;&amp;#x4E00;&amp;#x5929;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x7EC8;&amp;#x4E8E;&amp;#x628A;&amp;#x5927;&amp;#x6982;&amp;#x7684;&amp;#x5B9E;&amp;#x73B0;&amp;#x539F;&amp;#x7406;&amp;#x634B;&amp;#x987A;&amp;#x51FA;&amp;#x6765;&amp;#xFF0C;&amp;#x53C8;&amp;#x82B1;&amp;#x4E86;&amp;#x51E0;&amp;#x5929;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x6765;&amp;#x4E00;&amp;#x6B65;&amp;#x6B65;&amp;#x7684;&amp;#x5B9E;&amp;#x73B0;&amp;#xFF0C;&amp;#x89E3;&amp;#x51B3;bug&amp;#x3002;&amp;#x6700;&amp;#x540E;&amp;#x7EC8;&amp;#x4E8E;&amp;#x53EF;&amp;#x4EE5;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E0A;&amp;#x4E0B;&amp;#x4E0E;&amp;#x5DE6;&amp;#x540E;&amp;#x6ED1;&amp;#x52A8;&amp;#x540C;&amp;#x65F6;&amp;#x517C;&amp;#x5BB9;&amp;#x7684;&amp;#x6548;&amp;#x679C;&amp;#x4E86;&amp;#x3002;&amp;#x7531;&amp;#x4E8E;&amp;#x53EA;&amp;#x662F;&amp;#x9996;&amp;#x9875;&amp;#x6539;&amp;#x7248;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x53EA;&amp;#x662F;&amp;#x9996;&amp;#x9875;&amp;#x5B9E;&amp;#x73B0;&amp;#x4E86;&amp;#x6548;&amp;#x679C;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x5355;&amp;#x72EC;&amp;#x5199;&amp;#x4E00;&amp;#x4E2A;&amp;#x63A7;&amp;#x4EF6;&amp;#xFF0C;&amp;#x53EF;&amp;#x662F;&amp;#xFF0C;&amp;#x4E00;&amp;#x5468;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x60B2;&amp;#x5267;&amp;#x7684;&amp;#x4E8B;&amp;#x53D1;&amp;#x751F;&amp;#x4E86;&amp;#xFF1A;&amp;#x65B0;&amp;#x7684;&amp;#x4EA7;&amp;#x54C1;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E2D;&amp;#x6709;&amp;#x51E0;&amp;#x4E2A;&amp;#x9875;&amp;#x9762;&amp;#x90FD;&amp;#x662F;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&amp;#x3002;&amp;#x597D;&amp;#x5427;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x4E56;&amp;#x4E56;&amp;#x7684;&amp;#x5199;&amp;#x4E2A;&amp;#x63A7;&amp;#x4EF6;&amp;#x5427;&amp;#x3002;&amp;#x4E8E;&amp;#x662F;&amp;#xFF0C;&amp;#x5C31;&amp;#x6709;&amp;#x4E86;&lt;code&gt;SwipeTableView&lt;/code&gt;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;br&gt;&lt;/p&gt;
&lt;h4 id=&quot;&amp;#x5148;&amp;#x6765;&amp;#x51E0;&amp;#x5F20;&amp;#x9884;&amp;#x89C8;&amp;#x5427;&amp;#xFF1A;&quot;&gt;&lt;a href=&quot;#&amp;#x5148;&amp;#x6765;&amp;#x51E0;&amp;#x5F20;&amp;#x9884;&amp;#x89C8;&amp;#x5427;&amp;#xFF1A;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x5148;&amp;#x6765;&amp;#x51E0;&amp;#x5F20;&amp;#x9884;&amp;#x89C8;&amp;#x5427;&amp;#xFF1A;&quot;&gt;&lt;/a&gt;&amp;#x5148;&amp;#x6765;&amp;#x51E0;&amp;#x5F20;&amp;#x9884;&amp;#x89C8;&amp;#x5427;&amp;#xFF1A;&lt;/h4&gt;&lt;p&gt;&lt;img src=&quot;/roylee/2016/07/14/SwipeTableView/screenshot1.gif&quot; alt=&quot;OverView1&quot;&gt; &lt;img src=&quot;/roylee/2016/07/14/SwipeTableView/screenshot2.gif&quot; alt=&quot;OverView2&quot;&gt;&lt;/p&gt;
&lt;p&gt;&lt;br&gt;&lt;/p&gt;
&lt;h4 id=&quot;&amp;#x518D;&amp;#x6765;&amp;#x8BF4;&amp;#x4E00;&amp;#x4E0B;&amp;#x5B9E;&amp;#x73B0;&amp;#x539F;&amp;#x7406;&amp;#xFF1A;&quot;&gt;&lt;a href=&quot;#&amp;#x518D;&amp;#x6765;&amp;#x8BF4;&amp;#x4E00;&amp;#x4E0B;&amp;#x5B9E;&amp;#x73B0;&amp;#x539F;&amp;#x7406;&amp;#xFF1A;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x518D;&amp;#x6765;&amp;#x8BF4;&amp;#x4E00;&amp;#x4E0B;&amp;#x5B9E;&amp;#x73B0;&amp;#x539F;&amp;#x7406;&amp;#xFF1A;&quot;&gt;&lt;/a&gt;&amp;#x518D;&amp;#x6765;&amp;#x8BF4;&amp;#x4E00;&amp;#x4E0B;&amp;#x5B9E;&amp;#x73B0;&amp;#x539F;&amp;#x7406;&amp;#xFF1A;&lt;/h4&gt;&lt;p&gt;&lt;strong&gt; &amp;#x6700;&amp;#x521D;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x8003;&amp;#x8651;&amp;#x517C;&amp;#x5BB9;&amp;#x7B2C;&amp;#x4E09;&amp;#x65B9;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x6700;&amp;#x521D;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&amp;#x66F4;&amp;#x7B80;&amp;#x6D01;&amp;#xFF0C;&amp;#x6269;&amp;#x5C55;&amp;#x6027;&amp;#x4E5F;&amp;#x66F4;&amp;#x597D;&amp;#x3002;&amp;#x4E0B;&amp;#x9762;&amp;#x662F;&amp;#x539F;&amp;#x7406;&amp;#x7684;&amp;#x7ED3;&amp;#x6784;&amp;#x56FE;&amp;#x2014;&amp;#x2014; &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;/roylee/2016/07/14/SwipeTableView/SwipeTableViewStruct1.png&quot; alt=&quot;Model 1&quot;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#x9996;&amp;#x5148;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4E86;&amp;#x5B9E;&amp;#x73B0;&amp;#x5DE6;&amp;#x53F3;&amp;#x6ED1;&amp;#x52A8;&amp;#x7684;&amp;#x529F;&amp;#x80FD;&amp;#xFF0C;&amp;#x9700;&amp;#x8981;&amp;#x4E00;&amp;#x4E2A;view&amp;#x6765;&amp;#x4F5C;&amp;#x4E3A;&amp;#x6240;&amp;#x6709;&amp;#x5355;&amp;#x4E00;item&amp;#x7684;&amp;#x7236;&amp;#x89C6;&amp;#x56FE;&amp;#x8F7D;&amp;#x4F53;&amp;#xFF0C;&amp;#x5E76;&amp;#x63D0;&amp;#x4F9B;&amp;#x5DE6;&amp;#x53F3;&amp;#x6ED1;&amp;#x52A8;&amp;#x7684;&amp;#x529F;&amp;#x80FD;&amp;#xFF0C;&amp;#x8FD9;&amp;#x91CC;&amp;#x6CA1;&amp;#x6709;&amp;#x6BD4;&lt;code&gt;UICollectionView&lt;/code&gt;&amp;#x518D;&amp;#x5408;&amp;#x9002;&amp;#x7684;&amp;#x4E86;&amp;#x3002;&amp;#x6240;&amp;#x6709;&amp;#xFF0C;&amp;#x6211;&amp;#x7528;&amp;#x4E00;&amp;#x4E2A;CollectionView&amp;#x4F5C;&amp;#x4E3A;contentView&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&amp;#x6709;&amp;#x4E86;CollectionView&amp;#x4F5C;&amp;#x4E3A;&amp;#x8F7D;&amp;#x4F53;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x628A;&amp;#x6BCF;&amp;#x4E00;&amp;#x4E2A;ScrollView&amp;#x4F5C;&amp;#x4E3A;CollectionView&amp;#x7684;item&amp;#x5E73;&amp;#x94FA;&amp;#x4E86;&amp;#x3002;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x6700;&amp;#x5173;&amp;#x952E;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x6700;&amp;#x96BE;&amp;#x5904;&amp;#x7406;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x5728;&amp;#x6ED1;&amp;#x52A8;CollectionView&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x600E;&amp;#x6837;&amp;#x4FDD;&amp;#x8BC1;&amp;#x524D;&amp;#x540E;item&amp;#x80FD;&amp;#x591F;&amp;#x5BF9;&amp;#x9F50;&amp;#x5462;&amp;#xFF08;&amp;#x56E0;&amp;#x4E3A;&amp;#x60AC;&amp;#x505C;&amp;#xFF0C;&amp;#x53EA;&amp;#x6709;&amp;#x5BF9;&amp;#x9F50;&amp;#x624D;&amp;#x884C;&amp;#xFF09;&amp;#xFF1F;&amp;#x6700;&amp;#x540E;&amp;#x60F3;&amp;#x5230;&amp;#x7684;&amp;#x89E3;&amp;#x51B3;&amp;#x529E;&amp;#x6CD5;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x5728;cellForItem&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x4E2D;&amp;#xFF0C;&amp;#x5BF9;&amp;#x524D;&amp;#x540E;&amp;#x4E24;&amp;#x4E2A;item&amp;#x7684;contentOffset&amp;#x8FDB;&amp;#x884C;adjust&amp;#x4E00;&amp;#x81F4;&amp;#x6027;&amp;#x8C03;&amp;#x6574;&amp;#x3002;&amp;#x8FD9;&amp;#x6837;&amp;#x80FD;&amp;#x5B9E;&amp;#x73B0;&amp;#x524D;&amp;#x540E;&amp;#x4E24;&amp;#x4E2A;item&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#x662F;&amp;#x5408;&amp;#x7406;&amp;#x7684;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E3B;&amp;#x8981;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x5C31;&amp;#x662F;&amp;#xFF0C;&amp;#x591A;&amp;#x4E2A;item&amp;#x5171;&amp;#x7528;&amp;#x4E00;&amp;#x4E2A;header&amp;#x4E0E;bar&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x3002;&amp;#x65E2;&amp;#x7136;&amp;#x5171;&amp;#x7528;&amp;#xFF0C;&amp;#x6700;&amp;#x540E;&amp;#x60F3;&amp;#x5230;&amp;#xFF0C;&amp;#x90A3;&amp;#x5C31;&amp;#x8BA9;header&amp;#x4E0E;bar&amp;#x4E0E;CollectionView&amp;#x4E00;&amp;#x6837;&amp;#x4F5C;&amp;#x4E3A;SwipeTableView&amp;#x7684;&amp;#x5B50;&amp;#x89C6;&amp;#x56FE;&amp;#xFF0C;&amp;#x5E76;&amp;#x522B;&amp;#x5728;&amp;#x56FE;&amp;#x5C42;&amp;#x6700;&amp;#x4E0A;&amp;#x9762;&amp;#x3002;&amp;#x7531;&amp;#x4E8E;&amp;#x662F;&amp;#x72EC;&amp;#x7ACB;&amp;#x7684;view&amp;#xFF0C;&amp;#x4E4B;&amp;#x540E;&amp;#x5C31;&amp;#x8981;&amp;#x89E3;&amp;#x51B3;&amp;#x5F53;&amp;#x524D;item&amp;#x6ED1;&amp;#x52A8;&amp;#x540C;&amp;#x65F6;&amp;#x6EDA;&amp;#x52A8;&amp;#x5BF9;header&amp;#x4E0E;bar&amp;#x505A;&amp;#x8DDF;&amp;#x968F;&amp;#x5904;&amp;#x7406;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x4E86;&amp;#x3002;&amp;#x5728;&amp;#x8FD9;&amp;#x91CC;&amp;#xFF0C;&amp;#x5BF9;&amp;#x5F53;&amp;#x524D;&amp;#x7684;item&amp;#x8FDB;&amp;#x884C;KVO&amp;#xFF0C;&amp;#x5728;item&amp;#x7684;contentOffset&amp;#x53D1;&amp;#x751F;&amp;#x53D8;&amp;#x5316;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x540C;&amp;#x6837;&amp;#x6539;&amp;#x53D8;header&amp;#x4E0E;bar&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#xFF0C;&amp;#x4F7F;&amp;#x4E4B;&amp;#x603B;&amp;#x662F;&amp;#x8DDF;&amp;#x968F;scrollview&amp;#x7684;&amp;#x6EDA;&amp;#x52A8;&amp;#xFF0C;&amp;#x5E76;&amp;#x5728;&amp;#x60AC;&amp;#x505C;&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#x505A;&amp;#x5224;&amp;#x65AD;&amp;#xFF0C;&amp;#x56FA;&amp;#x5B9A;bar&amp;#x7684;frame&amp;#x7684;y&amp;#x503C;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&amp;#x8FD9;&amp;#x6837;&amp;#xFF0C;&amp;#x57FA;&amp;#x672C;&amp;#x7684;&amp;#x5B9E;&amp;#x73B0;&amp;#x5C31;&amp;#x5B8C;&amp;#x6210;&amp;#x4E86;&amp;#x3002;&amp;#x540C;&amp;#x65F6;&amp;#xFF0C;&lt;code&gt;SwipeTableView&lt;/code&gt;&amp;#x5141;&amp;#x8BB8;&amp;#x81EA;&amp;#x9002;&amp;#x5E94;contentSize&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x5728;item&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x5F88;&amp;#x5C11;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x4E5F;&amp;#x80FD;&amp;#x81EA;&amp;#x9002;&amp;#x5E94;&amp;#x7684;&amp;#x8C03;&amp;#x6574;contentSize&amp;#xFF0C;&amp;#x4FDD;&amp;#x6574;&amp;#x81F3;&amp;#x5C11;&amp;#x80FD;&amp;#x591F;&amp;#x6EDA;&amp;#x52A8;&amp;#x5230;&amp;#x9876;&amp;#x7AEF;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&amp;#x540E;&amp;#x671F;&amp;#xFF0C;&amp;#x7528;&amp;#x6237;&amp;#x7684;&amp;#x53CD;&amp;#x9988;header&amp;#x4E0D;&amp;#x80FD;&amp;#x6ED1;&amp;#x52A8;&amp;#xFF0C;&amp;#x6700;&amp;#x540E;&amp;#x901A;&amp;#x8FC7;&lt;code&gt;UIKitDynamic&lt;/code&gt;&amp;#x7269;&amp;#x7406;&amp;#x5F15;&amp;#x64CE;&amp;#x7684;&amp;#x65B9;&amp;#x5F0F;&amp;#x89E3;&amp;#x51B3;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#x3002;&lt;a href=&quot;http://philcai.com/2016/03/15/%E7%94%A8UIKit-Dynamics%E6%A8%A1%E4%BB%BFUIScrollView/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&lt;code&gt;&amp;#x53C2;&amp;#x8003;&amp;#x6587;&amp;#x7AE0;&lt;/code&gt;&lt;/a&gt; &lt;a href=&quot;http://holko.pl/2014/07/06/inertia-bouncing-rubber-banding-uikit-dynamics/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&lt;code&gt;&amp;#x82F1;&amp;#x6587;&amp;#x535A;&amp;#x5BA2;&lt;/code&gt;&lt;/a&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt; &amp;#x6700;&amp;#x521D;&amp;#x5F00;&amp;#x6E90;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x60F3;&amp;#x4F1A;&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x4F7F;&amp;#x7528;&amp;#xFF0C;&amp;#x800C;&amp;#x540E;&amp;#x671F;&amp;#xFF0C;&amp;#x5B9E;&amp;#x9645;&amp;#x7528;&amp;#x5230;&amp;#x4EBA;&amp;#x8D8A;&amp;#x6765;&amp;#x8D8A;&amp;#x591A;&amp;#xFF0C;&amp;#x5927;&amp;#x5BB6;&amp;#x4E5F;&amp;#x90FD;&amp;#x53CD;&amp;#x6620;&amp;#x9879;&amp;#x76EE;&amp;#x4E0D;&amp;#x80FD;&amp;#x652F;&amp;#x6301;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x4FBF;&amp;#x6709;&amp;#x4E86;&amp;#x7B2C;&amp;#x4E8C;&amp;#x79CD;&amp;#x8BBE;&amp;#x8BA1;&amp;#x65B9;&amp;#x5F0F;&amp;#x2014;&amp;#x2014; &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;/roylee/2016/07/14/SwipeTableView/SwipeTableViewStruct2.png&quot; alt=&quot;Model 2&quot;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7248;&amp;#x672C;&amp;#x4E2D;&amp;#xFF0C;&amp;#x8DDF;&amp;#x4E0A;&amp;#x9762;&amp;#x7684;&amp;#x7ED3;&amp;#x6784;&amp;#x539F;&amp;#x7406;&amp;#x662F;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x7684;&amp;#x3002;&amp;#x7531;&amp;#x4E8E;header&amp;#x4E0E;bar&amp;#x662F;&amp;#x72EC;&amp;#x7ACB;&amp;#x7684;&amp;#xFF0C;&amp;#x90A3;&amp;#x4E48;&amp;#x6BCF;&amp;#x4E2A;item&amp;#x5C31;&amp;#x8981;&amp;#x4E3A;header&amp;#x4E0E;bar&amp;#x7684;&amp;#x7A7A;&amp;#x95F4;&amp;#x7559;&amp;#x51FA;&amp;#x7A7A;&amp;#x767D;&amp;#x3002;&amp;#x800C;&amp;#x5728;&amp;#x7B2C;&amp;#x4E00;&amp;#x4E2A;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E2D;&amp;#xFF0C;&amp;#x662F;&amp;#x901A;&amp;#x8FC7;&amp;#x4FEE;&amp;#x6539;&amp;#x589E;&amp;#x52A0;&amp;#x6BCF;&amp;#x4E2A;item contentInset&amp;#x7684;top&amp;#x503C;&amp;#x6765;&amp;#x7559;&amp;#x51FA;&amp;#x9876;&amp;#x90E8;&amp;#x7684;&amp;#x7559;&amp;#x767D;&amp;#x3002;&amp;#x800C;&amp;#x51E0;&amp;#x4E4E;&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x7A7A;&amp;#x95F4;&amp;#x90FD;&amp;#x662F;&amp;#x4E0D;&amp;#x8003;&amp;#x8651;inset&amp;#xFF0C;&amp;#x76F4;&amp;#x63A5;&amp;#x8BBE;&amp;#x7F6E;&amp;#x5728;content&amp;#x7684;&amp;#x9876;&amp;#x90E8;&amp;#x7684;&amp;#xFF0C;&amp;#x800C;contentInset&amp;#x662F;&amp;#x4E0D;&amp;#x7B97;&amp;#x5185;&amp;#x5BB9;&amp;#x4E2D;&amp;#x7684;&amp;#xFF08;&amp;#x4E00;&amp;#x822C;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x63A7;&amp;#x4EF6;rame&amp;#x7684;y&amp;#x503C;&amp;#x90FD;&amp;#x662F;&amp;#x81EA;&amp;#x8EAB;&amp;#x9AD8;&amp;#x5EA6;&amp;#x7684;&amp;#x8D1F;&amp;#x503C;&amp;#xFF09;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x5728;&amp;#x6DFB;&amp;#x52A0;&amp;#x4E86;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x7EC4;&amp;#x4EF6;&amp;#x5176;&amp;#x5B9E;&amp;#x662F;&amp;#x85CF;&amp;#x5728;header&amp;#x4E0E;bar&amp;#x7684;&amp;#x4E0B;&amp;#x9762;&amp;#x7684;&amp;#xFF0C;&amp;#x5E95;&amp;#x90E8;&amp;#x4E5F;&amp;#x6B63;&amp;#x597D;&amp;#x8DDF;bar&amp;#x5BF9;&amp;#x9F50;&amp;#xFF08;&amp;#x8FD9;&amp;#x91CC;&amp;#x53EF;&amp;#x4EE5;&amp;#x901A;&amp;#x8FC7;&amp;#x8C03;&amp;#x6574;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x7EC4;&amp;#x4EF6;&amp;#x7684;frame&amp;#xFF0C;&amp;#x51CF;&amp;#x5C0F;y&amp;#x503C;&amp;#xFF0C;&amp;#x6765;&amp;#x663E;&amp;#x9732;&amp;#x4E0B;&amp;#x62C9;&amp;#x7EC4;&amp;#x4EF6;&amp;#x5373;&amp;#x53EF;&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4E3A;&amp;#x4E86;&amp;#x65B9;&amp;#x4FBF;&amp;#x4F7F;&amp;#x7528;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x517C;&amp;#x5BB9;&amp;#x7B2C;&amp;#x4E09;&amp;#x65B9;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#xFF0C;&amp;#x6700;&amp;#x540E;&amp;#x91C7;&amp;#x7528;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;item&amp;#x9876;&amp;#x90E8;&amp;#x7684;&amp;#x7559;&amp;#x767D;&amp;#x7531;tableHeaderVeiw&amp;#x4EE3;&amp;#x66FF;&amp;#xFF08;CollectionView&amp;#x65B9;&amp;#x9762;&amp;#x8981;&amp;#x7EE7;&amp;#x627F;&lt;code&gt;STCollectionView&lt;/code&gt;&amp;#x8BBE;&amp;#x7F6E;collectionHeaderView&amp;#xFF09;&amp;#x3002;&amp;#x4E0D;&amp;#x8FC7;&amp;#x8FD9;&amp;#x6837;&amp;#xFF0C;item&amp;#x7684;tableHeaderView&amp;#x5C31;&amp;#x662F;&amp;#x5360;&amp;#x7528;&amp;#x7684;&amp;#x4E86;&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x8003;&amp;#x8651;&amp;#x9879;&amp;#x76EE;&amp;#x7684;&amp;#x7B80;&amp;#x6D01;&amp;#x6027;&amp;#xFF0C;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x81EA;&amp;#x5B9A;&amp;#x4E49;&lt;code&gt;UIScrollView&lt;/code&gt;&amp;#x652F;&amp;#x6301;scrollview&amp;#x8BBE;&amp;#x7F6E;headerview&amp;#x3002;&amp;#x8FD9;&amp;#x6837;&amp;#x7528;&amp;#x6237;&amp;#x5B8C;&amp;#x5168;&amp;#x53EF;&amp;#x4EE5;&amp;#x53EA;&amp;#x662F;&amp;#x901A;&amp;#x8FC7;&amp;#x8BBE;&amp;#x7F6E;&amp;#x4E00;&amp;#x4E2A;&amp;#x5B8F;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x652F;&amp;#x6301;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#xFF0C;&amp;#x66F4;&amp;#x52A0;&amp;#x65B9;&amp;#x4FBF;&lt;br&gt;&lt;figure class=&quot;highlight plain&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;div class=&quot;line&quot;&gt;@define ST_PULLTOREFRESH_HEADER_HEIGHT xx&lt;/div&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x5176;&amp;#x4E2D;&lt;code&gt;xx&lt;/code&gt;&amp;#x662F;&amp;#x6307;&amp;#x4E0B;&amp;#x62C9;&amp;#x5237;&amp;#x65B0;&amp;#x7EC4;&amp;#x4EF6;RefreshHeader&amp;#x7684;&amp;#x9AD8;&amp;#x5EA6;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5C31;&amp;#x662F;&amp;#x5B8C;&amp;#x5168;&amp;#x663E;&amp;#x9732;RefreshHeader&amp;#x5F00;&amp;#x59CB;&amp;#x5237;&amp;#x65B0;&amp;#x7684;&amp;#x9AD8;&amp;#x5EA6;&amp;#xFF08;&amp;#x5982;&amp;#xFF1A;&lt;code&gt;MJRefresh&lt;/code&gt; &amp;#x4E3A; &lt;code&gt;MJRefreshHeaderHeight&lt;/code&gt;&amp;#xFF0C;&lt;code&gt;SVPullToRefresh&lt;/code&gt; &amp;#x4E3A; &lt;code&gt;SVPullToRefreshViewHeight&lt;/code&gt;&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#x6700;&amp;#x540E;&amp;#x5728;&amp;#x6DF7;&amp;#x5408;&amp;#x6A21;&amp;#x5F0F;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x51FA;&amp;#x73B0;&amp;#x4E86;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x6700;&amp;#x7EC8;&amp;#x53D1;&amp;#x73B0;&amp;#xFF0C;&amp;#x539F;&amp;#x6765;&lt;code&gt;UICollectionView&lt;/code&gt;&amp;#x4E0D;&amp;#x652F;&amp;#x6301;&amp;#x901A;&amp;#x8FC7;contentSize&amp;#x5C5E;&amp;#x6027;&amp;#x6765;&amp;#x6539;&amp;#x53D8;contentSize&amp;#x3002;&amp;#x6700;&amp;#x540E;&amp;#x53EA;&amp;#x597D;&amp;#x81EA;&amp;#x5B9A;&amp;#x4E49;&lt;code&gt;STCollectionView&lt;/code&gt;&amp;#xFF0C;&amp;#x540C;&amp;#x65F6;&amp;#x652F;&amp;#x6301;&amp;#x8BBE;&amp;#x7F6E;collectionHeaderView&amp;#xFF0C;&amp;#x540C;&amp;#x65F6;&amp;#x53EF;&amp;#x4EE5;&amp;#x5B9E;&amp;#x73B0;&amp;#x81EA;&amp;#x9002;&amp;#x5E94;contentSize&amp;#x3002;&amp;#x5173;&amp;#x4E8E;&lt;code&gt;STCollectionView&lt;/code&gt;&amp;#x7684;&amp;#x4F7F;&amp;#x7528;&amp;#x53EF;&amp;#x4EE5;&amp;#x8BE6;&amp;#x7EC6;&amp;#x770B;github&amp;#x793A;&amp;#x4F8B;&amp;#x3002;&lt;/p&gt;
&lt;!--&lt;div style=&quot;font-weight:900&quot;&gt;总结&lt;/div&gt;--&gt;
&lt;h4 id=&quot;&amp;#x603B;&amp;#x7ED3;&quot;&gt;&lt;a href=&quot;#&amp;#x603B;&amp;#x7ED3;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x603B;&amp;#x7ED3;&quot;&gt;&lt;/a&gt;&amp;#x603B;&amp;#x7ED3;&lt;/h4&gt;&lt;p&gt;&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x7684;&amp;#x7B2C;&amp;#x4E00;&amp;#x4E2A;&amp;#x6BD4;&amp;#x8F83;&amp;#x5B8C;&amp;#x5584;&amp;#x7684;&amp;#x5F00;&amp;#x6E90;&amp;#x9879;&amp;#x76EE;&amp;#xFF0C;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#x4E2D;&amp;#xFF0C;&amp;#x975E;&amp;#x5E38;&amp;#x611F;&amp;#x8C22;&amp;#x4F7F;&amp;#x7528;&amp;#x8005;&amp;#x7684;&amp;#x8BA4;&amp;#x540C;&amp;#x4E0E;&amp;#x652F;&amp;#x6301;&amp;#x3002;&amp;#x901A;&amp;#x8FC7;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#xFF0C;&amp;#x81EA;&amp;#x5DF1;&amp;#x786E;&amp;#x5B9E;&amp;#x5B66;&amp;#x5230;&amp;#x4E86;&amp;#x5F88;&amp;#x591A;&amp;#x4E1C;&amp;#x897F;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x5F00;&amp;#x8FD9;&amp;#x4E2A;&amp;#x535A;&amp;#x5BA2;&amp;#x4E5F;&amp;#x662F;&amp;#x6E90;&amp;#x4E8E;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#x7684;&amp;#x3002;&amp;#x4E2A;&amp;#x4EBA;&amp;#x89C9;&amp;#x5F97;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;&amp;#x5F00;&amp;#x53D1;&amp;#x8005;&amp;#x800C;&amp;#x8A00;&amp;#xFF0C;&amp;#x80FD;&amp;#x591F;&amp;#x53C2;&amp;#x4E0E;&amp;#x4E00;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#xFF0C;&amp;#x5E76;&amp;#x53BB;&amp;#x4E0D;&amp;#x65AD;&amp;#x7684;&amp;#x5B8C;&amp;#x5584;&amp;#x89E3;&amp;#x51B3;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x4ECE;&amp;#x4E2D;&amp;#x5F97;&amp;#x5230;&amp;#x7684;&amp;#x53D7;&amp;#x76CA;&amp;#x5C06;&amp;#x662F;&amp;#x975E;&amp;#x5E38;&amp;#x5927;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;p&gt;&lt;img src=&quot;/roylee/2016/07/14/SwipeTableView/logo.png&quot; alt=&quot;LOGO&quot;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x4F3C;&amp;#x534A;&amp;#x7CD6;
    
    </summary>
    
    
      <category term="SwipeTableVeiw" scheme="http://roylee.coding.me/tags/SwipeTableVeiw/"/>
    
      <category term="模拟UIScrollView" scheme="http://roylee.coding.me/tags/%E6%A8%A1%E6%8B%9FUIScrollView/"/>
    
  </entry>
  
  <entry>
    <title>从汽车修理工到iOS开发</title>
    <link href="http://roylee.coding.me/2016/07/05/%E6%88%91%E7%9A%84iOS%E5%BC%80%E5%8F%91%E4%B9%8B%E8%B7%AF/"/>
    <id>http://roylee.coding.me/2016/07/05/我的iOS开发之路/</id>
    <published>2016-07-05T15:35:02.000Z</published>
    <updated>2016-07-15T05:42:05.000Z</updated>
    
    <content type="html">&lt;p&gt;&amp;#x4ECE;&amp;#x4E8B;iOS&amp;#x5F00;&amp;#x53D1;&amp;#x5FEB;&amp;#x4E00;&amp;#x5E74;&amp;#x4E86;&amp;#xFF0C;&amp;#x4ECE;&amp;#x6765;&amp;#x6CA1;&amp;#x6709;&amp;#x60F3;&amp;#x8FC7;&amp;#x81EA;&amp;#x5DF1;&amp;#x7ADF;&amp;#x7136;&amp;#x8D70;&amp;#x4E0A;&amp;#x4E86;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x8FD9;&amp;#x6761;&amp;#x4E0D;&amp;#x5F52;&amp;#x8DEF;&amp;#x4E86;&amp;#x3002;&amp;#x60F3;&amp;#x60F3;&amp;#x8FD8;&amp;#x662F;&amp;#x86EE;&amp;#x6709;&amp;#x610F;&amp;#x601D;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt; &amp;#x534A;&amp;#x4E2A;&amp;#x673A;&amp;#x68B0;&amp;#x5E08; &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x56DE;&amp;#x5230;&amp;#x4E00;&amp;#x5E74;&amp;#x4EE5;&amp;#x524D;&amp;#xFF0C;&amp;#x6C7D;&amp;#x8F66;&amp;#x4FEE;&amp;#x7406;&amp;#x8F66;&amp;#x95F4;&amp;#x4E2D;&amp;#x8FD8;&amp;#x80FD;&amp;#x770B;&amp;#x89C1;&amp;#x6211;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7626;&amp;#x5F31;&amp;#x7684;&amp;#x8EAB;&amp;#x5F71;&amp;#x3002;&amp;#x5982;&amp;#x679C;&amp;#x8BF4;&amp;#xFF0C;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x662F;&amp;#x5C4C;&amp;#x4E1D;&amp;#x7684;&amp;#x8BDD;&amp;#xFF0C;&amp;#x90A3;&amp;#x65F6;&amp;#x7684;&amp;#x81EA;&amp;#x5DF1;&amp;#x771F;&amp;#x5B9E;&amp;#x8D85;&amp;#x7EA7;&amp;#x5C4C;&amp;#x4E1D;&amp;#x554A;&amp;#x3002;&amp;#x524D;&amp;#x4E0D;&amp;#x4E45;&amp;#xFF0C;&amp;#x4EE5;&amp;#x524D;&amp;#x4E00;&amp;#x5757;&amp;#x4FEE;&amp;#x8F66;&amp;#x7684;&amp;#x670B;&amp;#x53CB;&amp;#x53D1;&amp;#x6765;&amp;#x4E00;&amp;#x5F20;&amp;#x5077;&amp;#x62CD;&amp;#x7684;&amp;#x6211;&amp;#x7684;&amp;#x7167;&amp;#x7247;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x4E2A;&amp;#x5A18;&amp;#xFF0C;&amp;#x90A3;&amp;#x9ED1;&amp;#x7626;&amp;#x7684;&amp;#x4FE8;&amp;#x7136;&amp;#x5C31;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x5C0F;&amp;#x8001;&amp;#x5934;&amp;#x561B;&amp;#xFF0C;&amp;#x770B;&amp;#x7740;&amp;#x90FD;&amp;#x89C9;&amp;#x5F97;&amp;#x597D;&amp;#x7B11;&amp;#x3002;&amp;#x5728;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x4EBA;&amp;#x7684;&amp;#x773C;&amp;#x91CC;&amp;#xFF0C;&amp;#x4FEE;&amp;#x8F66;&amp;#x662F;&amp;#x4EF6;&amp;#x8F9B;&amp;#x82E6;&amp;#x7684;&amp;#x4E8B;&amp;#x60C5;&amp;#xFF0C;&amp;#x867D;&amp;#x7136;&amp;#x90A3;&amp;#x4E2A;&amp;#x65F6;&amp;#x5019;&amp;#x4E5F;&amp;#x5F88;&amp;#x5FD9;&amp;#xFF0C;&amp;#x53CC;&amp;#x624B;&amp;#x7684;&amp;#x6CB9;&amp;#x6E0D;&amp;#x4ECE;&amp;#x6765;&amp;#x90FD;&amp;#x662F;&amp;#x6D17;&amp;#x4E0D;&amp;#x6389;&amp;#x7684;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x8FD9;&amp;#x5374;&amp;#x4E0D;&amp;#x662F;&amp;#x80FD;&amp;#x591F;&amp;#x8BA9;&amp;#x6211;&amp;#x8F6C;&amp;#x884C;&amp;#x4ECE;&amp;#x4E8B;&amp;#x5F00;&amp;#x53D1;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7684;&amp;#x539F;&amp;#x56E0;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x90A3;&amp;#x540E;&amp;#x6765;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x505A;&amp;#x5F00;&amp;#x53D1;&amp;#x4E86;&amp;#x5462;&amp;#xFF1F;&amp;#x56E0;&amp;#x4E3A;&amp;#xFF0C;&amp;#x60F3;&amp;#x8981;&amp;#x66F4;&amp;#x597D;&amp;#x3002;&amp;#x6211;&amp;#x76F8;&amp;#x4FE1;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E00;&amp;#x4E2A;&amp;#x6709;&amp;#x70B9;&amp;#x60F3;&amp;#x6CD5;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x90FD;&amp;#x4E0D;&amp;#x662F;&amp;#x7518;&amp;#x4E8E;&amp;#x843D;&amp;#x5BDE;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x90FD;&amp;#x662F;&amp;#x60F3;&amp;#x8981;&amp;#x8BA9;&amp;#x81EA;&amp;#x5DF1;&amp;#x53D1;&amp;#x6325;&amp;#x66F4;&amp;#x5927;&amp;#x7684;&amp;#x4EF7;&amp;#x503C;&amp;#xFF0C;&amp;#x53BB;&amp;#x5B9E;&amp;#x73B0;&amp;#x81EA;&amp;#x5DF1;&amp;#x8FFD;&amp;#x6C42;&amp;#x7684;&amp;#x4EBA;&amp;#xFF08;&amp;#x597D;&amp;#x50CF;&amp;#x6709;&amp;#x70B9;&amp;#x9E21;&amp;#x6C64;&amp;#x554A;&amp;#xFF0C;&amp;#x5475;&amp;#x5475;&amp;#xFF09;&amp;#x3002;&amp;#x800C;&amp;#x6211;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x5982;&amp;#x6B64;&amp;#xFF08;&amp;#x771F;&amp;#x662F;&amp;#x5E9F;&amp;#x8BDD;~~&amp;#xFF09;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x5728;&amp;#x6211;&amp;#x5F00;&amp;#x59CB;&amp;#x9009;&amp;#x62E9;&amp;#x4FEE;&amp;#x8F66;&amp;#x884C;&amp;#x4E1A;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x5C31;&amp;#x5DF2;&amp;#x7ECF;&amp;#x505A;&amp;#x597D;&amp;#x4E86;&amp;#x6253;&amp;#x7B97;&amp;#xFF1A;&amp;#x56E0;&amp;#x4E3A;&amp;#x6CA1;&amp;#x6709;&amp;#x5B66;&amp;#x5386;&amp;#xFF0C;&amp;#x5C31;&amp;#x5148;&amp;#x4ECE;&amp;#x5B66;&amp;#x5F92;&amp;#x5F00;&amp;#x59CB;&amp;#xFF0C;&amp;#x8FB9;&amp;#x5E72;&amp;#x8FB9;&amp;#x5B66;&amp;#xFF1B;&amp;#x7136;&amp;#x540E;&amp;#xFF0C;&amp;#x53BB;&amp;#x9AD8;&amp;#x7AEF;&amp;#x7684;&amp;#x5730;&amp;#x65B9;&amp;#x4ECE;&amp;#x4E8B;&amp;#x9AD8;&amp;#x7AEF;&amp;#x8F66;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF1B;&amp;#x6700;&amp;#x540E;&amp;#xFF0C;&amp;#x8FDB;&amp;#x5165;4S&amp;#x5E97;&amp;#x3002;&amp;#x867D;&amp;#x7136;&amp;#xFF0C;&amp;#x90A3;&amp;#x4E2A;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x5E76;&amp;#x4E0D;&amp;#x770B;&amp;#x597D;&amp;#x6211;&amp;#x80FD;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A;&amp;#x884C;&amp;#x4E1A;&amp;#x575A;&amp;#x6301;&amp;#x4E0B;&amp;#x6765;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8FC7;&amp;#xFF0C;&amp;#x4E00;&amp;#x5E74;&amp;#x591A;&amp;#x4EE5;&amp;#x540E;&amp;#xFF0C;&amp;#x6211;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x72EC;&amp;#x7ACB;&amp;#x8D1F;&amp;#x8D23;&amp;#x9AD8;&amp;#x7AEF;&amp;#x8F66;&amp;#x7684;&amp;#x4FEE;&amp;#x7406;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4E86;&amp;#x3002;&amp;#x4F46;&amp;#x662F;&amp;#xFF0C;&amp;#x81EA;&amp;#x5DF1;&amp;#x5E76;&amp;#x4E0D;&amp;#x6EE1;&amp;#x8DB3;&amp;#x4E8E;&amp;#x5728;&amp;#x4E00;&amp;#x4E2A;&amp;#x4FEE;&amp;#x7406;&amp;#x5382;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x8981;&amp;#x53BB;&amp;#x66F4;&amp;#x4E13;&amp;#x4E1A;&amp;#x7684;&amp;#x5730;&amp;#x65B9;&amp;#xFF0C;&amp;#x53EA;&amp;#x6709;&amp;#x5728;&amp;#x90A3;&amp;#x91CC;&amp;#x624D;&amp;#x80FD;&amp;#x591F;&amp;#x66F4;&amp;#x52A0;&amp;#x7CBE;&amp;#x8FDB;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x6280;&amp;#x672F;&amp;#xFF0C;&amp;#x540C;&amp;#x65F6;&amp;#x63A5;&amp;#x89E6;&amp;#x66F4;&amp;#x591A;&amp;#x7684;&amp;#x8D44;&amp;#x6E90;&amp;#xFF0C;&amp;#x4E3A;&amp;#x81EA;&amp;#x5DF1;&amp;#x5C06;&amp;#x6765;&amp;#x505A;&amp;#x94FA;&amp;#x57AB;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt; &amp;#x4F60;&amp;#x53BB;&amp;#x641E;&amp;#x5F00;&amp;#x53D1;&amp;#x5427; &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x7136;&amp;#x800C;&amp;#xFF0C;&amp;#x4E8B;&amp;#x60C5;&amp;#x5E76;&amp;#x4E0D;&amp;#x4F1A;&amp;#x603B;&amp;#x662F;&amp;#x6309;&amp;#x7167;&amp;#x4EBA;&amp;#x4EEC;&amp;#x7684;&amp;#x610F;&amp;#x613F;&amp;#x53D1;&amp;#x5C55;&amp;#x3002;&amp;#x5728;&amp;#x90A3;&amp;#x4E2A;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C;&amp;#x6574;&amp;#x4E2A;&amp;#x884C;&amp;#x4E1A;&amp;#x4E5F;&amp;#x5E76;&amp;#x4E0D;&amp;#x5341;&amp;#x5206;&amp;#x666F;&amp;#x6C14;&amp;#xFF0C;4S&amp;#x5E97;&amp;#x7684;&amp;#x62DB;&amp;#x4EBA;&amp;#x4E5F;&amp;#x5E76;&amp;#x4E0D;&amp;#x662F;&amp;#x5F88;&amp;#x591A;&amp;#x3002;&amp;#x5C24;&amp;#x5176;&amp;#x662F;&amp;#x6211;&amp;#x8FD9;&amp;#x6837;&amp;#x6CA1;&amp;#x6709;&amp;#x5B66;&amp;#x5386;&amp;#x7684;&amp;#xFF08;4S&amp;#x5E97;&amp;#x5BF9;&amp;#x5B66;&amp;#x5386;&amp;#x8FD8;&amp;#x662F;&amp;#x5F88;&amp;#x6709;&amp;#x8981;&amp;#x6C42;&amp;#x7684;&amp;#xFF0C;&amp;#x540C;&amp;#x6837;&amp;#x6280;&amp;#x672F;&amp;#x751A;&amp;#x81F3;&amp;#x4E00;&amp;#x4E2A;&amp;#x66F4;&amp;#x597D;&amp;#xFF0C;&amp;#x800C;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x5B66;&amp;#x5386;&amp;#x5374;&amp;#x9AD8;&amp;#xFF0C;&amp;#x90A3;&amp;#x4E48;&amp;#x5728;&amp;#x57F9;&amp;#x8BAD;&amp;#x664B;&amp;#x5347;&amp;#x7684;&amp;#x9053;&amp;#x8DEF;&amp;#xFF0C;&amp;#x80AF;&amp;#x5B9A;&amp;#x662F;&amp;#x540E;&amp;#x8005;&amp;#xFF09;&amp;#xFF0C;&amp;#x800C;&amp;#x4E14;&amp;#xFF0C;&amp;#x5E2E;&amp;#x6211;&amp;#x4ECB;&amp;#x7ECD;4S&amp;#x5E97;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x5408;&amp;#x9002;&amp;#x7684;&amp;#x5730;&amp;#x65B9;&amp;#x53EF;&amp;#x4EE5;&amp;#x8BA9;&amp;#x6211;&amp;#x53BB;&amp;#x3002;&amp;#x5C31;&amp;#x8FD9;&amp;#x6837;&amp;#xFF0C;&amp;#x5230;&amp;#x4E86;&amp;#x90A3;&amp;#x5E74;&amp;#x7684;&amp;#x5E74;&amp;#x5E95;&amp;#x3002;&amp;#x56DE;&amp;#x5230;&amp;#x8001;&amp;#x5BB6;&amp;#xFF0C;&amp;#x4E00;&amp;#x684C;&amp;#x670B;&amp;#x53CB;&amp;#x4E00;&amp;#x5757;&amp;#x5403;&amp;#x996D;&amp;#xFF0C;&amp;#x804A;&amp;#x5929;&amp;#xFF0C;&amp;#x6700;&amp;#x540E;&amp;#x8BF4;&amp;#x5230;&amp;#x8FD9;&amp;#x4E2A;&amp;#x4E8B;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x670B;&amp;#x53CB;&amp;#x4E5F;&amp;#x5F88;&amp;#x662F;&amp;#x611F;&amp;#x6168;&amp;#xFF0C;&amp;#x4ED6;&amp;#x4EEC;&amp;#x5F53;&amp;#x7136;&amp;#x5E0C;&amp;#x671B;&amp;#x6211;&amp;#x80FD;&amp;#x6709;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF0C;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x53D1;&amp;#x5C55;&amp;#x3002;&amp;#x6700;&amp;#x540E;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x670B;&amp;#x53CB;&amp;#x5EFA;&amp;#x8BAE;&amp;#x8BA9;&amp;#x6211;&amp;#x91CD;&amp;#x65B0;&amp;#x601D;&amp;#x8003;&amp;#x4E86;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x89C4;&amp;#x5212; &amp;#x2014;&amp;#x2014; &amp;#x201C;&amp;#x4F60;&amp;#x53BB;&amp;#x641E;&amp;#x5F00;&amp;#x53D1;&amp;#x5427;&amp;#x201D;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt; &amp;#x4ECE;&amp;#x96F6;&amp;#x5F00;&amp;#x59CB; &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x6700;&amp;#x521D;&amp;#x8FD8;&amp;#x662F;&amp;#x6709;&amp;#x70B9;&amp;#x60F3;&amp;#x6CD5;&amp;#x60F3;&amp;#x8981;&amp;#x81EA;&amp;#x5B66;&amp;#xFF0C;&amp;#x540E;&amp;#x6765;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x5F88;&amp;#x81EA;&amp;#x77E5;&amp;#x7684;&amp;#x653E;&amp;#x5F03;&amp;#x4E86;&amp;#x81EA;&amp;#x5B66;&amp;#x3002;&amp;#x4E00;&amp;#x662F;&amp;#xFF0C;&amp;#x81EA;&amp;#x5DF1;&amp;#x4E00;&amp;#x70B9;&amp;#x8BA1;&amp;#x7B97;&amp;#x673A;&amp;#x7684;&amp;#x57FA;&amp;#x7840;&amp;#x90FD;&amp;#x6CA1;&amp;#x6709;&amp;#xFF1B;&amp;#x4E8C;&amp;#x6765;&amp;#xFF0C;&amp;#x81EA;&amp;#x5B66;&amp;#x7684;&amp;#x6548;&amp;#x7387;&amp;#x8FD8;&amp;#x662F;&amp;#x6BD4;&amp;#x8F83;&amp;#x4F4E;&amp;#x7684;&amp;#xFF0C;&amp;#x6CA1;&amp;#x6709;&amp;#x5168;&amp;#x804C;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x7CBE;&amp;#x529B;&amp;#x6295;&amp;#x5165;&amp;#x5927;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x53BB;&amp;#x627E;&amp;#x4E2A;&amp;#x57F9;&amp;#x8BAD;&amp;#x673A;&amp;#x6784;&amp;#x5427;&amp;#x3002;&amp;#x5C31;&amp;#x8FD9;&amp;#x6837;&amp;#xFF0C;&amp;#x5728;&amp;#x5E1D;&amp;#x90FD;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x84DD;&amp;#x8272;&amp;#x5C0F;&amp;#x9E1F;&amp;#x7684;&amp;#x673A;&amp;#x6784;&amp;#x5F00;&amp;#x59CB;&amp;#x4E86;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x7F16;&amp;#x7A0B;&amp;#x5B66;&amp;#x4E60;&amp;#x4E4B;&amp;#x8DEF;&amp;#x3002;&amp;#x6B63;&amp;#x5982;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;&amp;#x9884;&amp;#x6599;&amp;#x7684;&amp;#xFF0C;&amp;#x5C3C;&amp;#x739B;&amp;#xFF0C;&amp;#x5B66;&amp;#x4E2A;&amp;#x7F16;&amp;#x7A0B;&amp;#x8981;&amp;#x4E0D;&amp;#x8981;&amp;#x8FD9;&amp;#x4E48;&amp;#x96BE;&amp;#xFF1F;&amp;#x4E00;&amp;#x4E2A;C&amp;#x8BED;&amp;#x8A00;&amp;#x8981;&amp;#x4E0D;&amp;#x8981;&amp;#x8FD9;&amp;#x4E48;&amp;#x96BE;&amp;#xFF1F;&amp;#x4E00;&amp;#x4E2A;&amp;#x51FD;&amp;#x6570;&amp;#x8981;&amp;#x4E0D;&amp;#x8981;&amp;#x8FD9;&amp;#x4E48;&amp;#x96BE;&amp;#xFF1F;&amp;#x90A3;&amp;#x662F;&amp;#x7684;&amp;#x81EA;&amp;#x5DF1;&amp;#xFF0C;&amp;#x771F;&amp;#x662F;&amp;#x61F5;&amp;#x903C;&amp;#x7684;&amp;#xFF0C;&amp;#x611F;&amp;#x89C9;&amp;#x4EC0;&amp;#x4E48;&amp;#x90FD;&amp;#x662F;&amp;#x5403;&amp;#x529B;&amp;#x7684;&amp;#xFF0C;&amp;#x6211;&amp;#x89C9;&amp;#x5F97;&amp;#x6BD4;&amp;#x5927;&amp;#x7269;&amp;#x597D;&amp;#x4E0D;&amp;#x5230;&amp;#x54EA;&amp;#x53BB;&amp;#xFF08;&amp;#x4E5F;&amp;#x8BB8;&amp;#x53EA;&amp;#x662F;&amp;#x5BF9;&amp;#x4E8E;&amp;#x6211;&amp;#x8FD9;&amp;#x6837;&amp;#x4E00;&amp;#x4E2A;&amp;#x95E8;&amp;#x5916;&amp;#x6C49;&amp;#x5982;&amp;#x6B64;&amp;#xFF09;&amp;#x3002;&amp;#x4E3A;&amp;#x4E86;&amp;#x80FD;&amp;#x591F;&amp;#x66F4;&amp;#x5FEB;&amp;#x7684;&amp;#x638C;&amp;#x63E1;&amp;#x7F16;&amp;#x7A0B;&amp;#x8BED;&amp;#x8A00;&amp;#xFF0C;&amp;#x9664;&amp;#x4E86;&amp;#x8BFE;&amp;#x4E0A;&amp;#x542C;&amp;#x8001;&amp;#x5E08;&amp;#x7684;&amp;#x8BB2;&amp;#x8BFE;&amp;#xFF0C;&amp;#x81EA;&amp;#x4E60;&amp;#x5B8C;&amp;#x6210;&amp;#x4F5C;&amp;#x4E1A;&amp;#x5916;&amp;#x3002;&amp;#x6BCF;&amp;#x4E00;&amp;#x95E8;&amp;#x8BED;&amp;#x8A00;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C;&amp;#x53C8;&amp;#x5728;&amp;#x56FE;&amp;#x4E66;&amp;#x9986;&amp;#x501F;&amp;#x4E86;&amp;#x4E24;&amp;#x672C;&amp;#x4E66;&amp;#xFF0C;&amp;#x5373;&amp;#x4FBF;&amp;#x96BE;&amp;#x61C2;&amp;#xFF0C;&amp;#x4F46;&amp;#x4E5F;&amp;#x662F;&amp;#x5168;&amp;#x90E8;&amp;#x770B;&amp;#x5B8C;&amp;#x3002;&amp;#x6BCF;&amp;#x5929;&amp;#x7684;&amp;#x4F5C;&amp;#x606F;&amp;#x4E5F;&amp;#x662F;&amp;#x4E03;&amp;#x70B9;&amp;#x8D77;&amp;#x5E8A;&amp;#xFF0C;&amp;#x51CC;&amp;#x6668;&amp;#x7761;&amp;#x89C9;&amp;#x3002;&amp;#x5C31;&amp;#x8FD9;&amp;#x6837;&amp;#xFF0C;&amp;#x4E24;&amp;#x4E2A;&amp;#x6708;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x5B66;&amp;#x4E60;&amp;#x4E86;&amp;#x4E24;&amp;#x95E8;&amp;#x8BED;&amp;#x8A00;&amp;#xFF08;C &amp;amp; OC&amp;#xFF09;&amp;#x3002;&amp;#x73B0;&amp;#x5728;&amp;#xFF0C;&amp;#x60F3;&amp;#x60F3;&amp;#xFF0C;&amp;#x90A3;&amp;#x65F6;&amp;#x5019;&amp;#x770B;&amp;#x7684;&amp;#x90A3;&amp;#x4E9B;&amp;#x4E66;&amp;#x8D77;&amp;#x4E86;&amp;#x5F88;&amp;#x5927;&amp;#x7684;&amp;#x4F5C;&amp;#x7528;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EE5;&amp;#x540E;&amp;#x7684;&amp;#x5B66;&amp;#x4E60;&amp;#x8FD8;&amp;#x6709;&amp;#x5DE5;&amp;#x4F5C;&amp;#x6253;&amp;#x4E0B;&amp;#x4E86;&amp;#x57FA;&amp;#x7840;&amp;#x3002;&amp;#x63A5;&amp;#x7740;&amp;#x5C31;&amp;#x662F;UI&amp;#x3001;&amp;#x9879;&amp;#x76EE;&amp;#x4E86;&amp;#x3002;&amp;#x5BF9;&amp;#x4E8E;&amp;#x521D;&amp;#x5B66;&amp;#x5F00;&amp;#x53D1;&amp;#x7684;&amp;#x4EBA;&amp;#x6765;&amp;#x8BF4;&amp;#xFF0C;&amp;#x6211;&amp;#x89C9;&amp;#x5F97;&amp;#x505A;&amp;#x4E00;&amp;#x4E2A;&amp;#x5C5E;&amp;#x4E8E;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x3001;&amp;#x8BA4;&amp;#x771F;&amp;#x7684;&amp;#x9879;&amp;#x76EE;&amp;#x662F;&amp;#x5341;&amp;#x5206;&amp;#x5FC5;&amp;#x8981;&amp;#x7684;&amp;#x3002;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x4F1A;&amp;#x9047;&amp;#x5230;&amp;#x5404;&amp;#x79CD;&amp;#x5404;&amp;#x6837;&amp;#x7684;&amp;#x5B9E;&amp;#x9645;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x4F1A;&amp;#x9047;&amp;#x5230;&amp;#x5404;&amp;#x79CD;&amp;#x9700;&amp;#x6C42;&amp;#x7684;&amp;#x5B9E;&amp;#x73B0;&amp;#xFF0C;&amp;#x4F1A;&amp;#x9047;&amp;#x5230;&amp;#x5982;&amp;#x4F55;&amp;#x67E5;&amp;#x627E;&amp;#x95EE;&amp;#x9898;&amp;#x7B54;&amp;#x6848;&amp;#x641C;&amp;#x96C6;&amp;#x8D44;&amp;#x6599;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x3002;&amp;#x800C;&amp;#x8FD9;&amp;#x4E9B;&amp;#xFF0C;&amp;#x662F;&amp;#x6BCF;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x5FC5;&amp;#x987B;&amp;#x5177;&amp;#x5907;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x6280;&amp;#x80FD;&amp;#x3002;&amp;#x4E5F;&amp;#x53EA;&amp;#x6709;&amp;#x901A;&amp;#x8FC7;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x624D;&amp;#x80FD;&amp;#x53BB;&amp;#x638C;&amp;#x63E1;&amp;#x8FD9;&amp;#x4E9B;&amp;#x6280;&amp;#x80FD;&amp;#xFF0C;&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x6709;&amp;#x4E00;&amp;#x70B9;&amp;#x975E;&amp;#x5E38;&amp;#x91CD;&amp;#x8981;&amp;#xFF0C;&amp;#x90A3;&amp;#x5C31;&amp;#x662F;&amp;#xFF0C;&amp;#x4E00;&amp;#x5B9A;&amp;#x8981;&amp;#x5BF9;&amp;#x81EA;&amp;#x5DF1;&amp;#x8D1F;&amp;#x8D23;&amp;#xFF0C;&amp;#x6700;&amp;#x81EA;&amp;#x5DF1;&amp;#x6240;&amp;#x505A;&amp;#x7684;&amp;#x4E8B;&amp;#x8D1F;&amp;#x8D23;&amp;#xFF0C;&amp;#x80FD;&amp;#x591F;&amp;#x7CBE;&amp;#x76CA;&amp;#x6C42;&amp;#x7CBE;&amp;#x90A3;&amp;#x5C31;&amp;#x522B;&amp;#x8BA9;&amp;#x4ED6;&amp;#x4E0D;&amp;#x4F26;&amp;#x4E0D;&amp;#x7C7B;&amp;#x5427;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x8FD9;&amp;#x4E9B;&amp;#x88AB;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7EA2;&amp;#x5229;&amp;#x5438;&amp;#x5F15;&amp;#x8FC7;&amp;#x6765;&amp;#x7684;&amp;#x5F00;&amp;#x53D1;&amp;#x8005;&amp;#xFF0C;&amp;#x4E00;&amp;#x70B9;&amp;#x8981;&amp;#x9759;&amp;#x4E0B;&amp;#x5FC3;&amp;#x6765;&amp;#xFF0C;&amp;#x597D;&amp;#x597D;&amp;#x7684;&amp;#x78E8;&amp;#x70BC;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x6280;&amp;#x672F;&amp;#xFF0C;&amp;#x505A;&amp;#x4E00;&amp;#x4E2A;&amp;#x8BA4;&amp;#x771F;&amp;#x7684;&amp;#x4EBA;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt; &amp;#x4E00;&amp;#x5E74;&amp;#x7684;&amp;#x603B;&amp;#x7ED3; &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x65F6;&amp;#x95F4;&amp;#x8FC7;&amp;#x7684;&amp;#x8FD8;&amp;#x662F;&amp;#x5F88;&amp;#x5FEB;&amp;#x7684;&amp;#xFF0C;&amp;#x8F6C;&amp;#x773C;&amp;#x4E4B;&amp;#x95F4;&amp;#xFF0C;&amp;#x4E00;&amp;#x5E74;&amp;#x591A;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x5C31;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#x3002;&amp;#x73B0;&amp;#x5728;&amp;#x7684;&amp;#x81EA;&amp;#x5DF1;&amp;#x6280;&amp;#x672F;&amp;#x5728;&amp;#x4E0D;&amp;#x65AD;&amp;#x7684;&amp;#x63D0;&amp;#x9AD8;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5728;&amp;#x6709;&amp;#x66F4;&amp;#x591A;&amp;#x7684;&amp;#x8BA4;&amp;#x8BC6;&amp;#x3002;&amp;#x4E0E;&amp;#x6B64;&amp;#x540C;&amp;#x65F6;&amp;#xFF0C;&amp;#x4E5F;&amp;#x8BA9;&amp;#x81EA;&amp;#x5DF1;&amp;#x89C9;&amp;#x5F97;&amp;#x81EA;&amp;#x5DF1;&amp;#x771F;&amp;#x7684;&amp;#x5F88;low&amp;#xFF0C;&amp;#x61C2;&amp;#x5F97;&amp;#x4E1C;&amp;#x897F;&amp;#x3001;&amp;#x4F1A;&amp;#x7684;&amp;#x4E1C;&amp;#x897F;&amp;#x771F;&amp;#x662F;&amp;#x592A;&amp;#x5C11;&amp;#x592A;&amp;#x5C11;&amp;#x3002;&amp;#x8BA1;&amp;#x7B97;&amp;#x673A;&amp;#x7684;&amp;#x4E16;&amp;#x754C;&amp;#x91CC;&amp;#xFF0C;&amp;#x7F16;&amp;#x7A0B;&amp;#x7684;&amp;#x6D77;&amp;#x6D0B;&amp;#x4E2D;&amp;#xFF0C;&amp;#x81EA;&amp;#x5DF1;&amp;#x4E5F;&amp;#x5C31;&amp;#x662F;&amp;#x90A3;&amp;#x6E3A;&amp;#x5C0F;&amp;#x7684;&amp;#x6D6E;&amp;#x6E38;&amp;#x751F;&amp;#x7269;&amp;#x3002;&amp;#x4E0D;&amp;#x7BA1;&amp;#x672A;&amp;#x6765;&amp;#x5982;&amp;#x4F55;&amp;#xFF0C;&amp;#x8981;&amp;#x53BB;&amp;#x505A;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF0C;&amp;#x544A;&amp;#x8BEB;&amp;#x81EA;&amp;#x5DF1;&amp;#xFF0C;&amp;#x811A;&amp;#x8E0F;&amp;#x5B9E;&amp;#x5730;&amp;#x53BB;&amp;#x8D70;&amp;#x597D;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x6BCF;&amp;#x4E00;&amp;#x6B65;&amp;#x3002;&amp;#x8BF4;&amp;#x53E5;&amp;#x9898;&amp;#x5916;&amp;#x7684;&amp;#x8BDD;&amp;#xFF0C;&amp;#x73B0;&amp;#x5728;&amp;#x7684;&amp;#x5E02;&amp;#x573A;&amp;#xFF0C;&amp;#x5F00;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#x904D;&amp;#x5730;&amp;#x90FD;&amp;#x662F;&amp;#xFF0C;&amp;#x5F88;&amp;#x591A;&amp;#x4E5F;&amp;#x8DDF;&amp;#x6211;&amp;#x8FD9;&amp;#x6837;&amp;#xFF0C;&amp;#x88AB;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x8BF1;&amp;#x60D1;&amp;#x5438;&amp;#x5F15;&amp;#x4E86;&amp;#x8FC7;&amp;#x6765;&amp;#x3002;&amp;#x4F46;&amp;#x662F;&amp;#xFF0C;&amp;#x5373;&amp;#x4FBF;&amp;#x5982;&amp;#x6B64;&amp;#xFF0C;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x5927;&amp;#x73AF;&amp;#x5883;&amp;#x4E0B;&amp;#xFF0C;&amp;#x5728;&amp;#x5F00;&amp;#x53D1;&amp;#x7F16;&amp;#x7A0B;&amp;#x7684;&amp;#x6D6A;&amp;#x6F6E;&amp;#x4E2D;&amp;#xFF0C;&amp;#x90A3;&amp;#x4E9B;&amp;#x5584;&amp;#x4E8E;&amp;#x89E3;&amp;#x51B3;&amp;#x95EE;&amp;#x9898;&amp;#x3001;&amp;#x5177;&amp;#x6709;&amp;#x94BB;&amp;#x7814;&amp;#x7CBE;&amp;#x795E;&amp;#x3001;&amp;#x6280;&amp;#x672F;&amp;#x7CBE;&amp;#x6E5B;&amp;#x7684;&amp;#x4EBA;&amp;#x624D;&amp;#x8FD8;&amp;#x662F;&amp;#x7545;&amp;#x6E38;&amp;#x65E0;&amp;#x963B;&amp;#x7684;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x6240;&amp;#x6709;&amp;#x521A;&amp;#x5F00;&amp;#x59CB;&amp;#x4ECE;&amp;#x4E8B;&amp;#x5F00;&amp;#x53D1;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x6C89;&amp;#x4F4F;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x5FC3;&amp;#xFF0C;&amp;#x52AA;&amp;#x529B;&amp;#x63D0;&amp;#x9AD8;&amp;#x81EA;&amp;#x5DF1;&amp;#x5427;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8981;&amp;#x5728;&amp;#x6700;&amp;#x597D;&amp;#x7684;&amp;#x5E74;&amp;#x7EAA;&amp;#x8352;&amp;#x5E9F;&amp;#x4E86;&amp;#x9752;&amp;#x6625;&amp;#x3002;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x4ECE;&amp;#x4E8B;iOS&amp;#x5F00;&amp;#x53D1;&amp;#x5FEB;&amp;#x4E00;&amp;#x5E74;&amp;#x4E86;&amp;#xFF0C;&amp;#x4ECE;&amp;#x6765;&amp;#x6CA1;&amp;#x6709;&amp;#x60F3;&amp;#x8FC7;&amp;#x81EA;&amp;#x5DF
    
    </summary>
    
    
      <category term="iOS开发" scheme="http://roylee.coding.me/tags/iOS%E5%BC%80%E5%8F%91/"/>
    
  </entry>
  
</feed>
