<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="A blog of roylee，一个半路出家的iOS Coder的技术之路">
    <meta name="keyword"  content="Personal blog，iOS，Developer，Coder，博客，iOS开发，技术">
    <link rel="shortcut icon" href="/Roylee-ML.github.io/img/favicon.ico">

    <title>
        
          程序员读《格鲁夫给经理人的第一课》 - Roylee Blog From A iOS Developer
        
    </title>

    <link rel="canonical" href="http://error408.com/Roylee-ML.github.io/2017/02/12/程序员读《格鲁夫给经理人的第一课》/">

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/bootstrap.min.css">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/hux-blog.min.css">

    <!-- Pygments Github CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/syntax.css">

    <!-- Custom Fonts -->
    <!-- <link href="http://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="http://cdn.staticfile.org/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>

    <meta name="baidu-site-verification" content="zeyFn1s9OY" />
</head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/Roylee-ML.github.io/">Roylee&#39;s Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/Roylee-ML.github.io/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/tags/">Tags</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('http://blogsrc.error408.com/hexoblog/images/undefined')
    }
</style>
<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                          <a class="tag" href="/Roylee-ML.github.io/tags/#读书" title="读书">读书</a>
                        
                    </div>
                    <h1>程序员读《格鲁夫给经理人的第一课》</h1>
                    <h2 class="subheading"></h2>
                    <span class="meta">
                        Posted by Roylee on
                        2017-02-12
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <h3 id="&#x5F15;&#x5B50;"><a href="#&#x5F15;&#x5B50;" class="headerlink" title="&#x5F15;&#x5B50;"></a>&#x5F15;&#x5B50;</h3><p>&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x524D;&#x51E0;&#x65E5;&#x540C;&#x4E8B;&#x63A8;&#x8350;&#x7684;&#xFF0C;<strong>&#x662F;&#x4E00;&#x672C;&#x5199;&#x7ED9;&#x4E2D;&#x5C42;&#x7BA1;&#x7406;&#x8005;&#x7684;&#x4E66;</strong>&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x6BD4;&#x8F83;&#x9002;&#x5408;<strong>&#x8F6C;&#x5411;&#x7BA1;&#x7406;&#x7684;&#x7A0B;&#x5E8F;&#x5458;</strong>&#xFF08;&#x800C;&#x4F5C;&#x8005;&#x672C;&#x4EBA;&#x4E4B;&#x524D;&#x5C31;&#x662F;&#x4E00;&#x540D;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x3002;</p>
<p>&#x867D;&#x7136;&#x81EA;&#x5DF1;&#x4ECD;&#x7136;&#x662F;&#x4E2A; Coder&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x627E;&#x6765;&#x8FD9;&#x672C;&#x4E66;&#x8BFB;&#x4E86;&#x4E00;&#x904D;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x6BCF;&#x5929;&#x53EA;&#x662F;&#x57CB;&#x5934;&#x5728; Code &#x7684;&#x6D77;&#x6D0B;&#x4E2D;&#xFF0C;&#x4E5F;&#x8981;&#x6CE8;&#x91CD;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x89C4;&#x5212;&#x4E0E;&#x7BA1;&#x7406;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4EE3;&#x7801;&#x7684;&#x642C;&#x8FD0;&#x5DE5;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x5B9A;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x2014;&#x2014;&#x4E0D;&#x60F3;&#x5F53;&#x7BA1;&#x7406;&#x8005;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x5B9A;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x8BBE;&#x8BA1;&#x3002;&#x800C;&#x4F5C;&#x4E3A;&#x7BA1;&#x7406;&#x8005;&#xFF0C;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x5F53;&#x7136;&#x4E5F;&#x662F;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x81EA;&#x5DF1;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x5FC5;&#x8981;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x7BA1;&#x7406;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<h3 id="&#x4F5C;&#x8005;"><a href="#&#x4F5C;&#x8005;" class="headerlink" title="&#x4F5C;&#x8005;"></a>&#x4F5C;&#x8005;</h3><p>&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x8BFB;&#x4E00;&#x672C;&#x4E66;&#x9996;&#x5148;&#x8981;&#x770B;&#x770B;&#x4F5C;&#x8005;&#x662F;&#x8C01;&#x3002;&#x5982;&#x679C;&#x4F5C;&#x8005;&#x662F;&#x4E2A;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x4EBA;&#x7269;&#xFF0C;&#x4ED6;&#x5199;&#x7684;&#x4E66;&#x6B63;&#x5E38;&#x6765;&#x8BF4;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E66;&#x3002;&#x800C;&#x672C;&#x4E66;&#x7684;&#x4F5C;&#x8005;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#xFF08;TODO&#xFF1A;&#x4ECB;&#x7ECD;&#x4F5C;&#x8005;&#xFF09;</p>
<h3 id="&#x4E00;&#x4E9B;&#x611F;&#x89E6;"><a href="#&#x4E00;&#x4E9B;&#x611F;&#x89E6;" class="headerlink" title="&#x4E00;&#x4E9B;&#x611F;&#x89E6;"></a>&#x4E00;&#x4E9B;&#x611F;&#x89E6;</h3><p>&#x8FD9;&#x91CC;&#x53EA;&#x5199;&#x4E9B;&#x81EA;&#x5DF1;&#x8BFB;&#x5B8C;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E9B;&#x7406;&#x89E3;&#x4E0E;&#x60F3;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E66;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x4E0D;&#x505A;&#x8FC7;&#x591A;&#x7684;&#x9610;&#x8FF0;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x5728;&#x5510;&#x5DE7;&#x7684;&#x6587;&#x7AE0;<a href="http://blog.devtang.com/2016/06/06/high-output-management-summary/" target="_blank" rel="external">&#x5199;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x7BA1;&#x7406;&#x5165;&#x95E8;&#x8BFE;&#x7A0B; -&#x300A;&#x683C;&#x9C81;&#x592B;&#x7ED9;&#x7ECF;&#x7406;&#x4EBA;&#x7684;&#x7B2C;&#x4E00;&#x8BFE;&#x300B;</a>&#x91CC;&#xFF0C;&#x5DF2;&#x7ECF;&#x5BF9;&#x8FD9;&#x672C;&#x4E66;&#x505A;&#x4E86;&#x7CBE;&#x8981;&#x7684;&#x5F52;&#x7EB3;&#x3002;</p>
<h5 id="&#x600E;&#x6837;&#x641E;&#x751F;&#x4EA7;&#xFF1F;"><a href="#&#x600E;&#x6837;&#x641E;&#x751F;&#x4EA7;&#xFF1F;" class="headerlink" title="&#x600E;&#x6837;&#x641E;&#x751F;&#x4EA7;&#xFF1F;"></a>&#x600E;&#x6837;&#x641E;&#x751F;&#x4EA7;&#xFF1F;</h5><blockquote>
<p>&#x4F60;&#x5FC5;&#x987B;&#x6309;&#x9884;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x3001;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x54C1;&#x8D28;&#x4EE5;&#x53CA;&#x53EF;&#x80FD;&#x7684;&#x6700;&#x4F4E;&#x6210;&#x672C;&#xFF0C;&#x4F9D;&#x636E;&#x987E;&#x5BA2;&#x7684;&#x9700;&#x6C42;&#x5236;&#x9020;&#x53CA;&#x8FD0;&#x9001;&#x4EA7;&#x54C1;&#x3002;</p>
</blockquote>
<p>&#x800C;&#x8FD9;&#x91CC;&#x6D89;&#x53CA;&#x7684;&#x95EE;&#x9898;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x627E;&#x51FA;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x4E2D;&#x7684;&#x201C;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x201D;</li>
<li>&#x4F9D;&#x636E;&#x201C;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x201D;&#x627E;&#x51FA;&#x6700;&#x4F73;&#x7B56;&#x7565;</li>
<li>&#x6700;&#x540E;&#x6D4B;&#x8BD5;&#x4E0E;&#x9A8C;&#x8D27;</li>
</ul>
<p>&#x9996;&#x5148;&#xFF0C;&#x627E;&#x51FA;&#x201C;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x201D;&#x662F;&#x4E00;&#x9879;&#x67E5;&#x770B;&#x4E8B;&#x52A1;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x7B56;&#x7565;&#x3002;&#x6240;&#x8C13;&#x201C;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x201D;&#x662F;&#x90A3;&#x4E9B;<strong>&#x6700;&#x6602;&#x8D35;&#x3001;&#x6700;&#x56F0;&#x96BE;&#x3001;&#x6700;&#x654F;&#x611F;</strong>&#x7684;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6267;&#x884C;&#x751F;&#x4EA7;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x4F9D;&#x636E;&#x5176;&#x4E2D;&#x6700;&#x96BE;&#x641E;&#x5B9A;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x6765;&#x5236;&#x5B9A;&#x6574;&#x4E2A;&#x751F;&#x4EA7;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x867D;&#x7136;&#xFF0C;&#x683C;&#x9C81;&#x592B;&#x5728;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x201C;&#x65E9;&#x9910;&#x5E97;&#x7684;&#x751F;&#x4EA7;&#x7EBF;&#x201D;&#x7684;&#x4F8B;&#x5B50;&#x9610;&#x8FF0;&#x4E86;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x6307;&#x660E;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x65E9;&#x9910;&#x5E97;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x4F1A;&#x662F;&#x4EBA;&#x5458;&#x6570;&#x91CF;&#x3001;&#x8BBE;&#x5907;&#x4EA7;&#x80FD;&#x3001;&#x5E93;&#x5B58;&#x6570;&#x91CF;&#xFF08;&#x683C;&#x9C81;&#x592B;&#x53EA;&#x662F;&#x7ED9;&#x6211;&#x4EEC;&#x6307;&#x660E;&#x4E86;&#x65B9;&#x5411;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x6070;&#x6070;&#x8FD9;&#x4E2A;<strong>&#x627E;&#x51FA;&#x201C;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x201D;</strong>&#x7684;&#x8FC7;&#x7A0B;&#x624D;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5982;&#x4F55;&#x505A;&#x624D;&#x80FD;&#x627E;&#x51FA;&#x6240;&#x505A;&#x4E8B;&#x9879;&#x4E2D;&#x7684;&#x201C;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x201D;&#x5462;&#xFF1F;</p>
<p>&#x4ECE;&#x683C;&#x9C81;&#x592B;&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x770B;&#xFF0C;&#x4E0D;&#x96BE;&#x53D1;&#x73B0;&#x3002;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x8981;&#x638C;&#x63E1;&#x8DB3;&#x591F;&#x5145;&#x5206;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x800C;&#x4F5C;&#x8005;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x90E8;&#x5206;&#x4E5F;&#x5217;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x4E00;&#x5929;&#x5DE5;&#x4F5C;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x662F;&#x5728;&#x6536;&#x96C6;&#x4FE1;&#x606F;&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x8D44;&#x6E90;&#x4EE5;&#x53CA;&#x6240;&#x505A;&#x4E4B;&#x4E8B;&#x7684;&#x6E05;&#x695A;&#x8BA4;&#x8BC6;&#x3002;&#x8FD9;&#x4E5F;&#x6B63;&#x662F;&#x4E00;&#x4E2A;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x3001;&#x5206;&#x6790;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x505A;&#x5230;&#x8FD9;&#x70B9;&#x5C31;&#x8981;&#x5BF9;&#x95EE;&#x9898;&#x6709;&#x66F4;&#x6E05;&#x695A;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x629B;&#x5F03;&#x4E2A;&#x4EBA;&#x60C5;&#x7EEA;&#x66F4;&#x5168;&#x9762;&#x7684;&#x4E86;&#x89E3;&#x4E8B;&#x60C5;&#x7684;&#x72B6;&#x51B5;&#x3002;&#x800C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x5C31;&#x53EF;&#x80FD;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#x3001;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x3001;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x7B49;&#x3002;</p>
<p>&#x627E;&#x5230;&#x201C;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x201D;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x8981;&#x627E;&#x51FA;&#x6700;&#x4F73;&#x7684;&#x65B9;&#x6848;&#x7B56;&#x7565;&#x4E86;&#x3002;</p>
<p>&#x683C;&#x9C81;&#x592B;&#x8BA4;&#x4E3A;&#xFF0C;&#x51E1;&#x662F;&#x80FD;&#x4EE5;&#x6700;&#x4F4E;&#x6210;&#x672C;&#x8FBE;&#x5230;&#x7406;&#x60F3;&#x7684;&#x8FD0;&#x9001;&#x901F;&#x5EA6;&#x4EE5;&#x53CA;&#x54C1;&#x8D28;&#x7684;&#xFF0C;&#x4FBF;&#x662F;&#x6700;&#x4F73;&#x65B9;&#x6848;&#xFF08;&#x5F53;&#x7136;&#x8FD8;&#x662F;&#x4EE5;&#x65E9;&#x9910;&#x751F;&#x4EA7;&#x7EBF;&#x4E3A;&#x4F8B;&#xFF09;&#x3002;&#x7B80;&#x8A00;&#x4E4B;&#x5C31;&#x662F;&#x8981;&#x4EE5;<strong>&#x6700;&#x4F4E;&#x6210;&#x672C;&#x5B9E;&#x73B0;&#x7406;&#x60F3;&#x76EE;&#x6807;</strong>&#x7684;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x6700;&#x4F73;&#x65B9;&#x6848;&#x3002;&#x800C;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x683C;&#x9C81;&#x592B;&#x6240;&#x6307;&#x7684;&#x6210;&#x672C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7269;&#x8D28;&#x4E0A;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x66F4;&#x5E94;&#x8BE5;&#x662F;&#x5E7F;&#x4E49;&#x4E0A;&#x7684;&#x673A;&#x4F1A;&#x6210;&#x672C;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x6572;&#x5B9A;&#x4E00;&#x4E2A;&#x6700;&#x4F73;&#x65B9;&#x6848;&#x5462;&#xFF1F;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x8981;&#x6709;&#x65B9;&#x6848;&#x3002;&#x4F5C;&#x8005;&#x5E76;&#x6CA1;&#x6709;&#x9610;&#x8FF0;&#x5982;&#x4F55;&#x5236;&#x5B9A;&#x65B9;&#x6848;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x662F;&#x5206;&#x6790;&#x5982;&#x4F55;&#x5728;&#x5404;&#x4E2A;&#x65B9;&#x6848;&#x4E2D;&#x627E;&#x51FA;&#x6700;&#x4F73;&#x7684;&#x90A3;&#x4E2A;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5236;&#x5B9A;&#x65B9;&#x6848;&#xFF0C;&#x5C31;&#x8981;&#x5145;&#x5206;&#x53D1;&#x6325;&#x5404;&#x4E2A;&#x7ECF;&#x7406;&#x4EBA;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5728;&#x540E;&#x6587;&#x4E2D;&#xFF0C;&#x56E2;&#x961F;</p>
<p>2.&#x6548;&#x7387;&#x5E94;&#x8BE5;&#x662F;&#x672C;&#x4E66;&#x7684;&#x91CD;&#x70B9;&#xFF1B;&#x6548;&#x7387;&#x3001;&#x521B;&#x65B0;&#x3001;&#x81EA;&#x5F3A;</p>
<p>3.&#x4E00;&#x5BF9;&#x4E00;&#x4F1A;&#x8BAE;&#xFF0C;&#x4F1A;&#x8BAE;&#x7684;&#x76EE;&#x7684;&#x4E5F;&#x8981;&#x8D8A;&#x6765;&#x8D8A;&#x5355;&#x7EAF;&#xFF0C;&#x5426;&#x5219;&#x5931;&#x53BB;&#x4E86;&#x4F1A;&#x8BAE;&#x7684;&#x4F5C;&#x7528;</p>
<p>4.&#x5927;&#x6D6A;&#x6DD8;&#x6C99;&#xFF0C;&#x9002;&#x8005;&#x751F;&#x5B58;&#x3002;&#x4E0D;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x80FD; </p>
<p>5.&#x53EA;&#x6709;&#x5728;&#x53D8;&#x5316;&#x4E2D;&#x751F;&#x5B58;&#x7684;&#x4EBA;&#x624D;&#x4F1A;&#x5BF9;&#x672A;&#x6765;&#x62B1;&#x6301;&#x4E50;&#x89C2;&#x7684;&#x6001;&#x5EA6;</p>
<p>6.code &#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x5E94;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x5404;&#x79CD;&#x7A81;&#x53D1;&#x9700;&#x6C42;&#xFF0C;&#x5426;&#x5219;&#x9020;&#x6210;&#x7684;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x6DF7;&#x4E71;&#x3002;&#xFF08;&#x65E9;&#x9910;&#x5E97;&#x7684;&#x751F;&#x4EA7;&#x6D41;&#x7A0B;&#xFF09;</p>
<p>&#x65E9;&#x9910;&#x7684;&#x751F;&#x4EA7;&#x7EBF;</p>
<p>1.&#x627E;&#x51FA;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#xFF1A;&#x6700;&#x6602;&#x8D35;&#x3001;&#x6700;&#x56F0;&#x96BE;&#x3001;&#x6700;&#x654F;&#x611F;&#x7684;&#x9879;&#x76EE;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x4E5F;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x3001;&#x5206;&#x6790;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x80FD;&#x529B;&#x5374;&#x662F;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x800C;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5728;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x5173;&#x952E;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x5206;&#x6790;&#x6574;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x662F;&#x6574;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x9700;&#x6C42;&#x8BA8;&#x8BBA;&#x4E2D;&#x8981;&#x5145;&#x5206;&#x7684;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5DF2;&#x4F7F;&#x81EA;&#x5DF1;&#x66F4;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x9700;&#x6C42;&#x3002;</p>
<p>2.&#x6700;&#x4F4E;&#x6210;&#x672C;&#x5B9E;&#x73B0;&#x76EE;&#x7684;&#x7684;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x6700;&#x4F73;&#x65B9;&#x6848;&#x3002;&#x4F46;&#x8FD9;&#x91CC;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5E76;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x7269;&#x8D28;&#x6210;&#x672C;&#xFF0C;&#x800C;&#x662F;&#x673A;&#x4F1A;&#x6210;&#x672C;</p>
<p>3.&#x53CA;&#x65E9;&#x53D1;&#x73B0;&#x3001;&#x53CA;&#x65E9;&#x89E3;&#x51B3;&#x3002;&#x8FD9;&#x662F;&#x5728;&#x4F17;&#x591A;&#x7BA1;&#x7406;&#x5927;&#x5E08;&#x90FD;&#x4F1A;&#x63D0;&#x5230;&#x7684;&#x4E00;&#x70B9;&#x3002;</p>
<p>4.&#x627E;&#x51FA;&#x9650;&#x5236;&#x6B65;&#x9AA4;&#x7684;&#x524D;&#x63D0;&#x662F;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x5E76;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<p>5.&#x6307;&#x6807;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x76EE;&#x6807;&#xFF0C;&#x662F;&#x5927;&#x76EE;&#x6807;&#x4E0B;&#x7684;&#x5177;&#x4F53;&#x5C0F;&#x76EE;&#x6807;&#xFF0C;&#x540C;&#x65F6;&#x6709;&#x65F6;&#x53EF;&#x4EE5;&#x8861;&#x91CF;&#x53EF;&#x4EE5;&#x8BC4;&#x4F30;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6307;&#x6807;&#x7684;&#x8BC4;&#x4F30;&#x6BD4;&#x8F83;&#xFF0C;&#x6BCF;&#x5929;&#x8981;&#x505A;&#x603B;&#x7ED3;&#xFF0C;&#x5F52;&#x7EB3;&#x81EA;&#x5DF1;&#x7684;&#x5B8C;&#x6210;&#x5EA6;&#x3002;</p>
<p>6.&#x91CD;&#x590D;&#x5370;&#x8BC1;&#x8868;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#xFF0C;&#x65F6;&#x523B;&#x7684;&#x7763;&#x4FC3;&#x7BA1;&#x7406;&#x8005;&#x7684;&#x8DF5;&#x884C;&#x6210;&#x679C;</p>
<p>&#x56E2;&#x961F;&#x6218;</p>
<p>1.&#x6760;&#x6746;&#x7387;&#xFF0C;&#x5DE5;&#x4F5C;&#x7B80;&#x5355;&#x5316;</p>
<p>&#x7740;&#x773C;&#x4E8E;&#x4EA7;&#x51FA;&#x662F;&#x63D0;&#x9AD8;&#x4EA7;&#x80FD;&#x7684;&#x5173;&#x952E;&#xFF0C;&#x4EE5;&#x7ED3;&#x679C;&#x4E3A;&#x5BFC;&#x5411;</p>
<p>&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E; KPI&#xFF0C;&#x5176;&#x5B9E; KPI &#x5E76;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x9519;&#x7684;&#x53EA;&#x662F; KPI &#x7684;&#x5236;&#x5B9A;&#x89C4;&#x5219;&#x3002;&#x5C31;&#x50CF;&#x4E00;&#x4EA7;&#x51FA;&#x3001;&#x6307;&#x6807;&#x4E3A;&#x5BFC;&#x5411;&#xFF0C;&#x800C;&#x4EA7;&#x51FA;&#x3001;&#x6307;&#x6807;&#x7684;&#x5236;&#x5B9A;&#x5C31;&#x6781;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x6709;&#x9519;&#x8BEF;&#x7684;&#x6307;&#x6807;&#x4EE5;&#x53CA;&#x4EA7;&#x51FA;&#x6807;&#x51C6;&#xFF0C;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#x751F;&#x4EA7;&#x6548;&#x7387;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x9884;&#x6D4B;&#x4E0E;&#x91CD;&#x590D;&#x5370;&#x8BC1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x5B9E;&#x65F6;&#x7684;&#x770B;&#x770B;&#x5230;&#x7ED3;&#x679C;&#x5E76;&#x505A;&#x51FA;&#x53CA;&#x65F6;&#x7684;&#x8C03;&#x6574;</p>
<p>2.&#x6536;&#x96C6;&#x4FE1;&#x606F;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x5F00;&#x7BC7;&#x7684;&#x65E5;&#x672C;&#x5927;&#x5706;&#x684C;&#x4E0E;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x4E5F;&#x662F;&#x8BF4;&#x660E;&#x4FE1;&#x606F;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x4FE1;&#x606F;&#x6C9F;&#x901A;&#x589E;&#x52A0;&#x5F7C;&#x6B64;&#x4FE1;&#x606F;&#x6536;&#x96C6;&#x7684;&#x6982;&#x7387;</p>
<p>&#x6760;&#x6746;&#x7387;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x201C;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x7684;&#x7ECF;&#x7406;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x5F80;&#x5F80;&#x6765;&#x81EA;&#x4E8E;&#x7B80;&#x77ED;&#x800C;&#x975E;&#x6B63;&#x5F0F;&#x7684;&#x8C08;&#x8BDD;&#x201D;&#xFF08;&#x800C;&#x8FD9;&#x4E9B;&#x8C08;&#x8BDD;&#xFF0C;&#x53C8;&#x51B3;&#x5B9A;&#x4E8E;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x6C1B;&#x56F4;&#xFF09;&#x2014;&#x4FE1;&#x606F;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x8DDF;&#x5931;&#x6548;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x5173;&#x8054;</p>
<p>3.&#x7ED9;&#x4E88;&#x63D0;&#x793A;&#xFF08;&#x5EFA;&#x8BBE;&#x6027;&#x7684;&#x5EFA;&#x8BAE;&#x4E0E;&#x5F15;&#x5BFC;&#xFF09;&#xFF0C;&#x91CD;&#x8981;&#x4E8E;&#x6307;&#x5B9A;&#x51B3;&#x7B56;</p>
<p>4.&#x4F1A;&#x8BAE;&#x53EA;&#x662F;&#x6CA1;&#x63A5;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x4F20;&#x9012;&#x4FE1;&#x606F;&#x3001;&#x6307;&#x5B9A;&#x51B3;&#x7B56;&#x3002;&#x5173;&#x952E;&#x7684;&#x5728;&#x4E8E;&#xFF1A;&#x5FC5;&#x987B;&#x627E;&#x5230;&#x6700;&#x6709;&#x6548;&#x7684;&#x6CA1;&#x63A5;&#x5DF2;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;</p>
<p>5.&#x5728;&#x4F17;&#x591A;&#x6D3B;&#x52A8;&#x4E2D;&#x627E;&#x5230;&#x91CD;&#x70B9;</p>
<p>6.&#x6388;&#x6743;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF1A;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x76F8;&#x540C;&#x7684;&#x4FE1;&#x606F;&#x57FA;&#x7840;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x5F00;&#x5C55;&#x5DE5;&#x4F5C;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E0A;&#x6709;&#x4E00;&#x5957;&#x5F7C;&#x6B64;&#x8BA4;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>7.NOTE &#x7ECF;&#x7406;&#x4EBA;&#x7684;&#x6982;&#x5FF5;&#xFF1A;&#x5176;&#x5F71;&#x54CD;&#x8303;&#x56F4;&#x4E5F;&#x662F;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0B;&#x5C5E;&#xFF0C;&#x76F8;&#x5BF9;&#x7684;&#x4F60;&#x7684;&#x4E0A;&#x7EA7;&#x4E5F;&#x662F;&#x4F60;&#x7684;&#x4E0B;&#x5C5E;&#x3002;</p>
<p>8.&#x683C;&#x9C81;&#x592B;&#x7684;&#x5F00;&#x4F1A;&#x6982;&#x5FF5;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x4E92;&#x901A;&#x6709;&#x65E0;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6240;&#x4EE5;&#x4E0A;&#x53F8;&#x5728;&#x626E;&#x6F14;&#x4E00;&#x4E2A;&#x534F;&#x8C03;&#x8005;&#x3001;&#x5B66;&#x751F;&#x4E0E;&#x6559;&#x7EC3;&#x4E8E;&#x4E00;&#x8EAB;</p>
<p>9.&#x4E00;&#x5BF9;&#x4E00;&#x4F1A;&#x8BAE;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x5BF9;&#x4E00;&#x4EA4;&#x8C08;&#x3002;&#x7BA1;&#x7406;&#x7684;&#x91CD;&#x8981;&#x6982;&#x5FF5;&#x4E5F;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x5F53;&#x4F17;&#x6233;&#x7A7F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x5BF9;&#x4E00;&#x89E3;&#x51B3;&#x662F;&#x6700;&#x597D;&#x7684;</p>
<p>10.&#x4F1A;&#x8BAE;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5FC5;&#x8981;&#x6027;&#xFF0C;&#x662F;&#x5426;&#x503C;&#x5F97;&#x5F00;&#xFF1F;</p>
<p>11.&#x51B3;&#x7B56;&#xFF0C;&#x8981;&#x5145;&#x5206;&#x53D1;&#x6325;&#x6700;&#x4E86;&#x89E3;&#x95EE;&#x9898;&#x7684;&#x90A3;&#x4E9B;&#x4EBA;&#x7684;&#x4EF7;&#x503C; </p>
<p>12.&#x4F1A;&#x8BAE;&#x7684;&#x524D;&#x63D0;&#x662F;&#x8BF4;&#x771F;&#x8BDD;&#xFF0C;&#x53D1;&#x73B0;&#x771F;&#x76F8;&#xFF0C;&#x4E3A;&#x6B64;&#x8981;&#x5EFA;&#x7ACB;&#x201C;&#x72AF;&#x9519;&#x96BE;&#x514D;&#x201D;&#x7684;&#x6C1B;&#x56F4;&#x4E0E;&#x6587;&#x5316;</p>
<p>&#x63A8;&#x52A8;&#x7EC4;&#x7EC7;&#x7684;&#x5DE7;&#x624B;</p>
<p>1.&#x96C6;&#x6743;&#x653E;&#x6743;&#xFF1A;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#xFF0C;&#x5408;&#x7406;&#x5EFA;&#x8BAE;&#xFF0C;&#x4E0D;&#x8FC7;&#x5206;&#x5E72;&#x6D89;</p>
<p>2.&#x53CC;&#x91CD;&#x62A5;&#x544A;&#xFF0C;&#x53CC;&#x91CD;&#x804C;&#x8D23;&#x8EAB;&#x4EFD;&#x3002;&#x5145;&#x5206;&#x4E86;&#x89E3;&#x4FE1;&#x606F;&#xFF0C;&#x6C9F;&#x901A;&#x3002;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5458;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E0D;&#x81F3;&#x4E8E;&#x5176;&#x4ED6;&#x4EBA;&#x5458;&#x8131;&#x8282;&#x3002;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x9886;&#x5BFC;&#x7406;&#x5E94;&#x5411;&#x4E0A;&#x7EA7;&#x62A5;&#x544A;&#xFF0C;&#x4F46;&#x662F;&#x540C;&#x65F6;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x4ED6;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x6709;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4E0D;&#x81F3;&#x4E8E;&#x4ED6;&#x7684;&#x4F5C;&#x7528;&#x88AB;&#x5C40;&#x9650;&#x5316;&#xFF09;</p>
<p>&#x4E34;&#x65F6;&#x5C0F;&#x7EC4;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x6210;&#x7ACB;&#x5C0F;&#x7EC4;&#x3002;&#x5B8C;&#x6210;&#x540E;&#x89E3;&#x6563;&#x5C0F;&#x7EC4;</p>
<p>&#x8C0B;&#x4E8B;&#x5728;&#x4EBA;</p>
<p>1.&#x7ECF;&#x7406;&#x4EBA;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x6FC0;&#x53D1;&#x4E0B;&#x5C5E;&#x7684;&#x6700;&#x4F73;&#x8868;&#x73B0;&#x3002;&#x4E0D;&#x540C;&#x65F6;&#x4EE3;&#x7684;&#x7BA1;&#x7406;&#x98CE;&#x683C;&#x4E5F;&#x5927;&#x591A;&#x56F4;&#x7ED5;&#x7740;&#x6FC0;&#x52B1;&#x673A;&#x5236;</p>


                <hr>

                
                <!-- 多说 Share start -->
                </style>
                <div class="ds-share"
                    style="text-align: right"
                    data-thread-key="2017/02/12/程序员读《格鲁夫给经理人的第一课》/"
                    data-title="程序员读《格鲁夫给经理人的第一课》"
                    data-url="http://error408.com/Roylee-ML.github.io/2017/02/12/程序员读《格鲁夫给经理人的第一课》/"
                    data-images=""
                    data-content="&#x5F15;&#x5B50;&#x8FD9;&#x672C;&#x4E66;&#x662F... | Roylee Blog From A iOS Developer " >
                    <div class="ds-share-inline">
                      <ul  class="ds-share-icons-16">
                        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="#">分享到：</a></li>
                        <li><a class="ds-wechat flat" href="javascript:void(0);" data-service="wechat">微信</a></li>
                        <li><a class="ds-weibo flat" href="javascript:void(0);" data-service="weibo">微博</a></li>
                        <li><a class="ds-douban flat" href="javascript:void(0);" data-service="douban">豆瓣</a></li>
                      </ul>
                      <div class="ds-share-icons-more">
                      </div>
                    </div>
                <hr>
                </div>
                <!-- 多说 Share end-->
                

                <ul class="pager">
                    
                    
                        <li class="next">
                            <a href="/Roylee-ML.github.io/2016/08/04/Swift Method Swizzling/" data-toggle="tooltip" data-placement="top" title="Swift中使用Method Swizzling">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                
                <!-- 多说评论框 start -->
                <div class="comment">
                    <div class="ds-thread"
                        data-thread-key="2017/02/12/程序员读《格鲁夫给经理人的第一课》/"
                        data-title="程序员读《格鲁夫给经理人的第一课》"
                        data-url="http://error408.com/Roylee-ML.github.io/2017/02/12/程序员读《格鲁夫给经理人的第一课》/" >
                    </div>
                </div>
                <!-- 多说评论框 end -->
                

                

            </div>
    <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/Roylee-ML.github.io/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/Roylee-ML.github.io/tags/#读书" title="读书">读书</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="http://birdmichael.com/" target="_blank">BirdMichael&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>


<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
    // dynamic User by Hux
    var _user = 'error408';

    // duoshuo comment query.
    var duoshuoQuery = {short_name: _user };
    (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0]
         || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
</script>
<!-- 多说公共JS代码 end -->






<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("http://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;
            left: -0.75em;
            font-size: 1.1em;
            margin-top : -0.1em;
        }
    }
</style>



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/error408">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="https://www.facebook.com/roylee.stillway">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-facebook fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://github.com/Roylee-ML">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Roylee&#39;s Blog 2018 
                    <br>
                    Theme by <a href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a href="http://blog.kaijun.rocks">Kaijun</a> <!-- | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe> -->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->
<script src="/Roylee-ML.github.io/js/jquery.min.js"></script>

<!-- Bootstrap Core JavaScript -->
<script src="/Roylee-ML.github.io/js/bootstrap.min.js"></script>

<!-- Custom Theme JavaScript -->
<script src="/Roylee-ML.github.io/js/hux-blog.min.js"></script>


<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://error408.com/Roylee-ML.github.io/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '63fd5f0468edd7f1983edc897f814664';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->





<!-- Image to hack wechat -->
<img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0" />
<!-- Migrate from head to bottom, no longer block render and still work -->

</body>

</html>
