<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="A blog of roylee，一个半路出家的iOS Coder的技术之路">
    <meta name="keyword"  content="Personal blog，iOS，Developer，Coder，博客，iOS开发，技术">
    <link rel="shortcut icon" href="/Roylee-ML.github.io/img/favicon.ico">

    <title>
        
          我与阿里的两次邂逅 - Roylee Blog From A iOS Developer
        
    </title>

    <link rel="canonical" href="http://error408.com/Roylee-ML.github.io/2018/03/07/我与阿里的两次邂逅/">

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/bootstrap.min.css">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/hux-blog.min.css">

    <!-- Pygments Github CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/syntax.css">

    <!-- Custom Fonts -->
    <!-- <link href="http://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="http://cdn.staticfile.org/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>

    <meta name="baidu-site-verification" content="zeyFn1s9OY" />
</head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/Roylee-ML.github.io/">Roylee&#39;s Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/Roylee-ML.github.io/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/tags/">Tags</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('http://blogsrc.error408.com/hexoblog/images/base/info-bg.jpg')
    }
</style>
<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                          <a class="tag" href="/Roylee-ML.github.io/tags/#阿里" title="阿里">阿里</a>
                        
                          <a class="tag" href="/Roylee-ML.github.io/tags/#面试" title="面试">面试</a>
                        
                    </div>
                    <h1>我与阿里的两次邂逅</h1>
                    <h2 class="subheading"></h2>
                    <span class="meta">
                        Posted by Roylee on
                        2018-03-07
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <p>&#x8FD9;&#x662F;&#x4E00;&#x7BC7;&#x5BF9;&#x524D;&#x9635;&#x5B50;&#x963F;&#x91CC;&#x9762;&#x8BD5;&#x7684;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;&#xFF0C;&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x9762;&#x8BD5;&#x4E0E;&#x5B66;&#x4E60;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x7ED3;&#x5C3E;&#x6709;&#x5F69;&#x86CB;&#x54E6;~&#x3002;</p>
<h4 id="&#x521D;&#x8BC6;&#x963F;&#x91CC;"><a href="#&#x521D;&#x8BC6;&#x963F;&#x91CC;" class="headerlink" title="&#x521D;&#x8BC6;&#x963F;&#x91CC;"></a>&#x521D;&#x8BC6;&#x963F;&#x91CC;</h4><p>&#x90A3;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x662F; 16 &#x5E74;&#x7684;&#x590F;&#x5929;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x7167;&#x4F8B;&#x901B;&#x5FAE;&#x535A;&#x6D4F;&#x89C8;&#x5927;&#x4F6C;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x79C1;&#x4FE1;&#x91CC;&#x5374;&#x6709;&#x4E2A;&#x6765;&#x81EA;&#x5927;&#x4F6C;&#x7684;&#x7559;&#x8A00;&#xFF0C;&#x95EE;&#x6211;&#x6709;&#x6CA1;&#x6709;&#x5174;&#x8DA3;&#x53BB;&#x963F;&#x91CC;&#x3002;&#x3002;&#x3002;&#x6211;&#x53BB;&#xFF0C;&#x5F53;&#x65F6;&#x771F;&#x662F;&#x53D7;&#x5BA0;&#x82E5;&#x60CA;&#xFF0C;&#x60F3;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x534A;&#x8DEF;&#x51FA;&#x5BB6;&#x4EC5;&#x6709;&#x4E00;&#x5E74;&#x7ECF;&#x9A8C;&#x7684; iOS &#x5C45;&#x7136;&#x88AB;&#x963F;&#x91CC;&#x7684;&#x4EBA;&#x770B;&#x4E0A;&#xFF0C;&#x89C9;&#x5F97;&#x8FD8;&#x662F;&#x633A;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x7684;&#x3002;</p>
<p>&#x6FC0;&#x52A8;&#x5F52;&#x6FC0;&#x52A8;&#xFF0C;&#x5E73;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x60F3;&#x60F3;&#x4E5F;&#x8FD8;&#x662F;&#x6709;&#x539F;&#x56E0;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x5FD9;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x7A7A;&#x95F2;&#x7684;&#x65F6;&#x95F4;&#x5199;&#x4E86;&#x4E2A;&#x5F00;&#x6E90;<a href="https://github.com/Roylee-ML/SwipeTableView" target="_blank" rel="external">SwipeTableView</a>&#xFF0C;&#x5728;&#x540C;&#x4E8B;&#x4E0E;&#x670B;&#x53CB;&#x7684;&#x652F;&#x6301;&#x4E0B;&#xFF0C;&#x4E5F;&#x5F00;&#x4E86;&#x535A;&#x5BA2;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x53D7;&#x5230;&#x4E86;&#x8BB8;&#x591A;&#x4EBA;&#x7684;&#x5173;&#x6CE8;&#x3002;&#x60F3;&#x6765;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x8FD8;&#x771F;&#x662F;&#x5F97;&#x4F1A;&#x63A8;&#x9500;&#x81EA;&#x5DF1;&#x554A;&#xFF08;&#x8FD9;&#x5E74;&#x5934;&#xFF0C;&#x8D76;&#x811A;&#x6CA1;&#x4E2A;&#x535A;&#x5BA2;&#x90FD;&#x62FF;&#x4E0D;&#x51FA;&#x624B;&#x4E86;&#x1F613;&#xFF09;&#x3002;</p>
<p>&#x800C;&#x540E;&#x7684;&#x4E0D;&#x4E45;&#xFF0C;Prisma &#x5927;&#x706B;&#x3002;&#x81EA;&#x5DF1;&#x672C;&#x7740;&#x5B66;&#x4E60; Swift&#xFF08;&#x540C;&#x65F6;&#x8E6D;&#x8E6D;&#x70ED;&#x5EA6;&#x1F602;&#xFF09;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x7528;&#x4E00;&#x5468;&#x7684;&#x65F6;&#x95F4;&#x5199;&#x4E86;&#x4E2A;&#x9879;&#x76EE;<a href="https://github.com/Roylee-ML/PrismaSimpleImagePicker" target="_blank" rel="external">PrismaSimpleImagePicker</a>&#xFF0C;&#x91CD;&#x5199;&#x4E86; Prisma &#x7684;&#x6240;&#x6709; UI &#x529F;&#x80FD;&#xFF0C;&#x5305;&#x62EC;&#x62CD;&#x7167;&#x3001;&#x56FE;&#x7247;&#x9009;&#x62E9;&#x5668;&#x3001;&#x56FE;&#x7247;&#x7F16;&#x8F91;&#x7B49;&#x3002;&#x5F53;&#x7136;&#xFF0C;Prisma &#x7684;&#x6838;&#x5FC3;&#x2013;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x6CA1;&#x6709;&#x505A;&#x7684;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E5F;&#x6070;&#x6070;&#x662F;&#x6709;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x624D;&#x53D7;&#x5230;&#x4E86;&#x963F;&#x91CC;&#x5927;&#x4F6C;&#x7684;&#x5173;&#x6CE8;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x6211;&#x8FD8;&#x662F;&#x633A;&#x8E0F;&#x5B9E;&#x7684;&#x4E00;&#x4EBA;&#x513F;&#xFF08;&#x867D;&#x7136;&#x524D;&#x4E24;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x9879;&#x76EE;&#x90FD;&#x88AB;&#x6211;&#x5E72;&#x9EC4;&#x4E86;&#xFF0C;&#x5475;&#x5475;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x62D2;&#x7EDD;&#x4E86;&#x5927;&#x4F6C;&#x7684;&#x597D;&#x610F;&#x3002;&#x76F4;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x9879;&#x76EE;&#x9A6C;&#x4E0A;&#x8981;&#x5BA3;&#x5E03;&#x505C;&#x6389;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x81EA;&#x5DF1;&#x624D;&#x539A;&#x8138;&#x76AE;&#x7684;&#x53C8;&#x627E;&#x4E86;&#x5927;&#x4F6C;&#x3002;</p>
<p>&#x5927;&#x4F6C;&#x4EBA;&#x5F88; nice&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x5E2E;&#x6211;&#x5185;&#x63A8;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x8D1F;&#x4F17;&#x671B;&#xFF0C;&#x6700;&#x540E;&#x8FDE;&#x4E2A;&#x9762;&#x8BD5;&#x8DDF;&#x53CD;&#x9988;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x5C31;&#x76F4;&#x63A5; GG &#x4E86;&#x3002;&#x73B0;&#x5728;&#x770B;&#x6765;&#xFF0C;&#x90A3;&#x65F6;&#x786E;&#x5B9E;&#x8FD8;&#x5F88;&#x6E23;&#xFF0C;&#x7B80;&#x5386;&#x4E5F;&#x5F88; low &#x903C;&#x3002;</p>
<h4 id="&#x518D;&#x7EED;&#x524D;&#x7F18;"><a href="#&#x518D;&#x7EED;&#x524D;&#x7F18;" class="headerlink" title="&#x518D;&#x7EED;&#x524D;&#x7F18;"></a>&#x518D;&#x7EED;&#x524D;&#x7F18;</h4><p>17 &#x5E74;&#x5E95;&#xFF0C;&#x770B;&#x5230;&#x6709;&#x4EBA;&#x5206;&#x4EAB;&#x7684;&#x5927;&#x5382;&#x9762;&#x8BD5;&#x7ECF;&#x9A8C;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x540E;&#x8FD8;&#x6709;&#x963F;&#x91CC;&#x7684; HC&#x3002;&#x90A3;&#x65F6;&#xFF0C;&#x5C31;&#x5FC3;&#x52A8;&#x4E86;&#xFF0C;&#x60F3;&#x8981;&#x518D;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x963F;&#x91CC;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x52A0;&#x4E86;&#x90A3;&#x54E5;&#x4EEC;&#x7684;&#x5FAE;&#x4FE1;&#xFF0C;&#x6700;&#x540E;&#x4ED6;&#x670B;&#x53CB;&#x5E2E;&#x6211;&#x505A;&#x4E86;&#x5185;&#x63A8;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x6B21;&#x662F;&#x597D;&#x597D;&#x51C6;&#x5907;&#x7684;&#x4E86;&#x3002;&#x7B80;&#x5386;&#x4E5F;&#x597D;&#x597D;&#x7684;&#x5F04;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4E5F;&#x63D0;&#x524D;&#x590D;&#x4E60;&#x4E86;&#x8BB8;&#x591A;&#x5E95;&#x5C42;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x7B49;&#x5F85;&#x9762;&#x8BD5;&#x7684;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x8FD8;&#x662F;&#x5F88;&#x7D27;&#x5F20;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x8FC7;&#x5F80;&#x7684;&#x7ECF;&#x5386;&#x662F;&#x4E0D;&#x662F;&#x7B26;&#x5408;&#x963F;&#x91CC;&#x7684;&#x8981;&#x6C42;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5927;&#x6982;&#x4E00;&#x5468;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#x6536;&#x5230;&#x4E86;&#x963F;&#x91CC;&#x4E00;&#x9762;&#x7684;&#x7535;&#x8BDD;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#xFF0C;&#x963F;&#x91CC;&#x7684;&#x9762;&#x8BD5;&#x8FD8;&#x662F;&#x5F88;&#x4E2D;&#x80AF;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x5361;&#x5B66;&#x5386;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4E5F;&#x66F4;&#x91CD;&#x89C6;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x5B9E;&#x9645;&#x80FD;&#x529B;&#x4E0E;&#x5728;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#x6DF1;&#x5EA6;&#x3002;</p>
<p>&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E86;&#x4E24;&#x8F6E;&#x9762;&#x8BD5;&#xFF0C;&#x6302;&#x5728;&#x4E86;&#x4E09;&#x9762;&#x4E0E; boss &#x7684;&#x89C6;&#x9891;&#x9762;&#x8BD5;&#xFF08;&#x539F;&#x672C;&#x5B9A;&#x7684;&#x89C6;&#x9891;&#x9762;&#x8BD5;&#x7531;&#x4E8E;&#x963F;&#x91CC;&#x90A3;&#x8FB9;&#x89C6;&#x9891;&#x51FA;&#x95EE;&#x9898;&#x6700;&#x540E;&#x6539;&#x4E3A;&#x4E86;&#x7535;&#x8BDD;&#x9762;&#x8BD5;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x4E09;&#x9762;&#x5F88;&#x5173;&#x952E;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x51C6;&#x5907;&#xFF0C;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x4E2A;&#x4EBA;&#x8D76;&#x811A;&#x804A;&#x5F97;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x7535;&#x8BDD;&#x521A;&#x6302;&#xFF0C;&#x65C1;&#x8FB9;&#x7684;&#x5973;&#x53CB;&#x5C31;&#x4E00;&#x987F;&#x6570;&#x843D;&#xFF0C;&#x8BF4;&#x6211;&#x4E00;&#x4E94;&#x4E00;&#x5341;&#x7684;&#x8BF4;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x5386;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x8F6C;&#x884C; iOS &#x7684;&#x539F;&#x56E0;&#x4EC0;&#x4E48;&#x7684;&#xFF08;&#x5176;&#x5B9E;&#x8FD9;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#x65E9;&#x6709;&#x4ECB;&#x7ECD;&#xFF0C;&#x54C8;&#x54C8;&#xFF09;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x4E3B;&#x89C1;&#x4E0D;&#x559C;&#x6B22;&#x6280;&#x672F;&#x7684;&#x4EBA;&#x1F605;&#x3002;&#x3002;&#x3002;&#x679C;&#x4E0D;&#x5176;&#x7136;&#xFF0C;&#x6700;&#x540E;&#x8FD8;&#x6302;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x5177;&#x4F53;&#x5565;&#x539F;&#x56E0;&#x5427;&#xFF0C;&#x7B80;&#x5386;&#x80FD;&#x8FC7;&#xFF0C;&#x6700;&#x540E;&#x5374;&#x6B7B;&#x5728;&#x4E86;&#x4E09;&#x9762;&#x3002;&#x3002;&#x3002;</p>
</blockquote>
<p>&#x867D;&#x7136;&#x6302;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x56DE;&#x8FC7;&#x5934;&#x770B;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x8FD9;&#x4E24;&#x6B21;&#x5185;&#x63A8;&#x963F;&#x91CC;&#x7684;&#x90E8;&#x95E8;&#xFF0C;&#x7ADF;&#x7136;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x90E8;&#x95E8;&#x3002;&#x611F;&#x6168;&#x547D;&#x8FD0;&#x771F;&#x662F;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h4 id="&#x603B;&#x7ED3;&#x5206;&#x4EAB;"><a href="#&#x603B;&#x7ED3;&#x5206;&#x4EAB;" class="headerlink" title="&#x603B;&#x7ED3;&#x5206;&#x4EAB;"></a>&#x603B;&#x7ED3;&#x5206;&#x4EAB;</h4><p>&#x6700;&#x540E;&#xFF0C;&#x6765;&#x70B9;&#x5E72;&#x8D27;&#xFF0C;&#x5206;&#x4EAB;&#x4E0B;&#x8FD9;&#x4E24;&#x6B21;&#xFF0C;&#x4E0D;&#xFF0C;&#x662F;&#x8FD9;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#x963F;&#x91CC;&#x7684;&#x7ECF;&#x9A8C;&#x3002;</p>
<ul>
<li>&#x9996;&#x9875;&#xFF0C;&#x7B80;&#x5386;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5728;&#x5185;&#x63A8;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x7279;&#x610F;&#x54A8;&#x8BE2;&#x4E86;&#x5927;&#x4F6C;&#x3002;&#x7B80;&#x5386;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x4EAE;&#x70B9;&#xFF0C;&#x80FD;&#x591F;&#x7A81;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x5728;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x7684;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x7B49;&#x7B49;&#x3002;&#x7B80;&#x5386;&#x5343;&#x4E07;&#x4E0D;&#x80FD;&#x5343;&#x7BC7;&#x4E00;&#x5F8B;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x5199;&#x7CBE;&#x901A;&#x7684;&#x90A3;&#x79CD;&#x4E00;&#x770B;&#x5C31;&#x662F;&#x57F9;&#x8BAD;&#x51FA;&#x6765;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x603B;&#x7ED3;&#x7684;&#x4EBA;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x57F9;&#x8BAD;&#x51FA;&#x6765;&#x7684;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x963F;&#x91CC;&#x7684;&#x7B80;&#x5386;&#x8BC4;&#x5BA1;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x8FC7;&#x3002;</li>
</ul>
<ul>
<li><p>&#x5176;&#x6B21;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x9762;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x5728;&#x5317;&#x4EAC;&#x9762;&#x676D;&#x5DDE;&#x7684;&#x5C97;&#xFF0C;&#x6240;&#x4EE5;&#x90FD;&#x662F;&#x7535;&#x8BDD;&#x9762;&#x8BD5;&#x3002;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E00;&#x9762;&#x5728;&#x6280;&#x672F;&#x9762;&#x4E2D;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#x3002;&#x4E00;&#x9762;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#x5F88;&#x6709;&#x903B;&#x8F91;&#xFF0C;&#x5148;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#xFF0C;&#x518D;&#x8C08;&#x8C08;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x804C;&#x8D23;&#x3001;&#x4EAE;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x9879;&#x76EE;&#x5C55;&#x5F00;&#x95EE;&#x4E9B;&#x6280;&#x672F;&#x95EE;&#x9898;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4E5F;&#x4F1A;&#x5355;&#x72EC;&#x95EE;&#x4E9B;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x6839;&#x636E;&#x9762;&#x8BD5;&#x8005;&#x7684;&#x56DE;&#x7B54;&#x5C55;&#x5F00;&#x5176;&#x4ED6;&#x6280;&#x672F;&#x70B9;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x51B7;&#x9759;&#x81EA;&#x4FE1;&#x8FD8;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x8981;&#x6709;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;&#x4E00;&#x9762;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x963F;&#x91CC;&#x90A3;&#x8FB9;&#x51FA;&#x4E86;&#x4E00;&#x9053;&#x7B14;&#x8BD5;&#x9898;&#xFF0C;&#x662F;&#x4EE5;&#x90AE;&#x4EF6;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x8981;&#x6C42;&#x5728;&#x6B21;&#x65E5;&#x7684;&#x4E2D;&#x5348;&#x4E4B;&#x524D;&#x56DE;&#x590D;&#xFF08;&#x8FD9;&#x4E2A;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x9762;&#x5408;&#x683C;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x540C;&#x90E8;&#x95E8;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x6837;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x963F;&#x91CC;&#x7684;&#x7B14;&#x8BD5;&#x9898;&#xFF0C;&#x4E25;&#x683C;&#x4E0A;&#x4E0D;&#x80FD;&#x7B97;&#x662F;&#x7B97;&#x6CD5;&#x9898;&#xFF0C;&#x7ED9;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x573A;&#x666F;&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x6570;&#x5B66;&#x9898;&#x3002;&#x6211;&#x60F3;&#x963F;&#x91CC;&#x7740;&#x91CD;&#x8003;&#x5BDF;&#x7684;&#x662F;&#x9762;&#x8BD5;&#x8005;&#x7684;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x4E0E;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E00;&#x9762;&#x4E5F;&#x4F1A;&#x95EE;&#x9898;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7B97;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x64C5;&#x957F;&#xFF0C;&#x4E0D;&#x4F1A;&#x7684;&#x95EE;&#x9898;&#x4E5F;&#x90FD;&#x76F4;&#x63A5;&#x8BF4;&#x4E0D;&#x4F1A;&#x4E86;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x4E4B;&#x540E;&#xFF0C;&#x662F;&#x4E8C;&#x9762;&#x3002;&#x4E8C;&#x9762;&#x4E5F;&#x662F;&#x7535;&#x8BDD;&#x9762;&#x8BD5;&#xFF0C;&#x53EF;&#x80FD;&#x7531;&#x4E8E;&#x963F;&#x91CC;&#x6709;&#x4EA4;&#x53C9;&#x9762;&#x8BD5;&#x8FD9;&#x56DE;&#x4E8B;&#xFF08;&#x770B;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#xFF0C;&#x786E;&#x5B9E;&#x53EA;&#x6709;&#x4E8C;&#x9762;&#x7684;&#x4E0D;&#x540C;&#xFF09;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x611F;&#x89C9;&#x5E76;&#x4E0D;&#x5982;&#x4E00;&#x9762;&#x51C6;&#x5907;&#x7684;&#x5145;&#x5206;&#x3002;&#x804A;&#x4E86;&#x5927;&#x6982;&#x56DB;&#x5341;&#x5206;&#x949F;&#xFF0C;&#x4E3B;&#x8981;&#x4E5F;&#x662F;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#xFF0C;&#x8BF4;&#x8BF4;&#x96BE;&#x70B9;&#x4EAE;&#x70B9;&#xFF0C;&#x6700;&#x540E;&#x4E5F;&#x95EE;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x6B21;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x7B54;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x9762;&#x6211;&#x81EA;&#x5DF1;&#xFF0C;&#x4E5F;&#x8981;&#x597D;&#x597D;&#x8003;&#x91CF;&#x4E00;&#x4E0B;&#x7684;&#x3002;&#x5E86;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4E8C;&#x9762;&#x6700;&#x7EC8;&#x662F;&#x8FC7;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x963F;&#x91CC;&#x90A3;&#x8FB9;&#x4F1A;&#x7EFC;&#x5408;&#x8BC4;&#x5BA1;&#x4E00;&#x4E0B;&#x5427;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x6BCF;&#x6B21;&#x9762;&#x8BD5;&#x4E4B;&#x540E;&#x90FD;&#x4F1A;&#x5BF9;&#x9762;&#x8BD5;&#x5B98;&#x6709;&#x4E2A;&#x63D0;&#x95EE;&#x3002;&#x611F;&#x89C9;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x597D;&#x597D;&#x51C6;&#x5907;&#x4E00;&#x4E0B;&#x7684;&#xFF0C;&#x76F8;&#x4E92;&#x7684;&#x63D0;&#x95EE;&#x4E5F;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x5F7C;&#x6B64;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7531;&#x4E8E;&#x4E8C;&#x9762;&#x5F88;&#x7A81;&#x7136;&#xFF0C;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x600E;&#x4E48;&#x51C6;&#x5907;&#xFF0C;&#x6700;&#x540E;&#x4E5F;&#x662F;&#x76F4;&#x63A5;&#x95EE;&#x4E86;&#x9762;&#x8BD5;&#x5B98;&#x81EA;&#x5DF1;&#x7684;&#x8868;&#x73B0;&#x5982;&#x4F55;&#xFF1F;&#x6709;&#x4EC0;&#x4E48;&#x5EFA;&#x8BAE;&#xFF1F;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x95EE;&#x4E86;&#x4E00;&#x4E0B;&#x5DE5;&#x4F5C;&#x804C;&#x8D23;&#x7B49;&#x5176;&#x4ED6;&#x5185;&#x5BB9;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x6700;&#x540E;&#xFF0C;&#x5C31;&#x662F; boss &#x9762;&#x3002;&#x8FD9;&#x4E00;&#x9762;&#x8DDF;&#x9884;&#x60F3;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x804A;&#x804A;&#x9879;&#x76EE;&#xFF0C;&#x95EE;&#x95EE;&#x7ECF;&#x5386;&#xFF0C;&#x4E86;&#x89E3;&#x4E0B;&#x5E73;&#x65F6;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x4EE5;&#x53CA;&#x672A;&#x6765;&#x7684;&#x89C4;&#x5212;&#x4EC0;&#x4E48;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x56E0;&#x4E3A;&#xFF0C;&#x8FD9;&#x4E00;&#x9762;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x6240;&#x4EE5;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x5145;&#x5206;&#x51C6;&#x5907;&#x4E86;&#xFF0C;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x5B9E;&#x6253;&#x5B9E;&#x7684;&#x5168;&#x76D8;&#x8131;&#x51FA;&#x3002;&#x7531;&#x4E8E;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x6302;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6CA1;&#x5565;&#x7ECF;&#x9A8C;&#x53EF;&#x5206;&#x4EAB;&#x4E86;&#x3002;&#x81F3;&#x4E8E;&#xFF0C;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#xFF0C;&#x8981;&#x4E0D;&#x8981;&#x7C89;&#x9970;&#x81EA;&#x5DF1;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x662F;&#x4EC1;&#x8005;&#x89C1;&#x4EC1;&#x667A;&#x8005;&#x89C1;&#x667A;&#x5427;&#x3002;</p>
</blockquote>
</li>
</ul>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x6709;&#x7684;&#x963F;&#x91CC;&#x9762;&#x8BD5;&#x7ECF;&#x5386;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4E09;&#x9762;&#x8FC7;&#x4E86;&#xFF0C;&#x6B63;&#x5E38;&#x53EF;&#x80FD;&#x5C31;&#x662F; HR &#x9762;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684; boss &#x5C31;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x4E86;&#x3002;&#x800C;&#x5BF9;&#x5F85;&#x9762;&#x8BD5;&#xFF0C;<strong>&#x4E00;&#x5B9A;&#x662F;&#x8981;&#x8BA4;&#x771F;&#x51C6;&#x5907;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x8981;&#x6709;&#x4E2A;&#x653E;&#x677E;&#x7684;&#x5FC3;&#x6001;</strong>&#x3002;</p>
<h4 id="&#x6765;&#x81EA;&#x534A;&#x540A;&#x5B50;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x603B;&#x7ED3;"><a href="#&#x6765;&#x81EA;&#x534A;&#x540A;&#x5B50;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x603B;&#x7ED3;" class="headerlink" title="&#x6765;&#x81EA;&#x534A;&#x540A;&#x5B50;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x603B;&#x7ED3;"></a>&#x6765;&#x81EA;&#x534A;&#x540A;&#x5B50;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x603B;&#x7ED3;</h4><p>&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8F6C;&#x884C; iOS &#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x57F9;&#x8BAD;&#x51FA;&#x8EAB;&#x6211;&#x89C9;&#x5F97;&#x4E5F;&#x5E76;&#x4E0D;&#x6BD4;&#x522B;&#x4EBA;&#x4F4E;&#x4E00;&#x7B49;&#x3002;&#x5173;&#x952E;&#x8FD8;&#x662F;&#x8981;&#x5728;&#x5F00;&#x53D1;&#x8FD9;&#x6761;&#x9053;&#x4E0A;&#x8D8A;&#x8D70;&#x8D8A;&#x9ED1;&#x624D;&#x884C;&#x3002;&#x3002;&#x3002;</p>
<ul>
<li><p>&#x8981;&#x60F3;&#x63D0;&#x9AD8; iOS &#x7684;&#x6280;&#x80FD;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x94BB;&#x7814;&#x7CBE;&#x795E;&#xFF0C;&#x5BF9;&#x5DE5;&#x4F5C;&#xFF0C;&#x5BF9;&#x4EE3;&#x7801;&#x3002;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#x800C;&#x505A;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x6807;&#x5C3A;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x6807;&#x5C3A;&#x4E0D;&#x7528;&#x592A;&#x9AD8;&#xFF0C;&#x4E5F;&#x4E0D;&#x7528;&#x8DDF;&#x522B;&#x4EBA;&#x6BD4;&#xFF0C;&#x5C31;&#x8981;&#x6C42;&#x4E0B;&#x81EA;&#x5DF1;&#x3001;&#x8DDF;&#x81EA;&#x5DF1;&#x505A;&#x4E2A;&#x6BD4;&#x8F83;&#x5C31;&#x597D;&#x3002;&#x6BCF;&#x6B21;&#x642C;&#x7816;&#xFF0C;&#x53EF;&#x4EE5;&#x95EE;&#x4E0B;&#x81EA;&#x5DF1;&#x6709;&#x6CA1;&#x6709;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x5B9E;&#x73B0;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6574;&#x5929;&#x52A0;&#x73ED;&#x5230;&#x4E5D;&#x5341;&#x70B9;&#x7684;&#x82E6;&#x903C;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x5DE5;&#x4F5C;&#x662F;&#x6700;&#x76F4;&#x63A5;&#x7684;&#x4FEE;&#x884C;&#x624B;&#x6BB5;&#x4E86;&#xFF0C;&#x4E14;&#x884C;&#x4E14;&#x73CD;&#x60DC;&#x5427;&#x3002;</p>
<blockquote>
<p>&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6280;&#x80FD;&#x7684;&#x63D0;&#x5347;&#x4E00;&#x5B9A;&#x662F;&#x5F88;&#x5FEB;&#x7684;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x4E0B;&#x9762;&#x51E0;&#x70B9;&#x7684;&#x524D;&#x63D0;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x53E6;&#x4E00;&#x4E2A;&#xFF0C;&#x53EF;&#x4EE5;&#x8BD5;&#x7740;&#x5F00;&#x6E90;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x653E;&#x5728; github &#x4E0A;&#x3002;&#x5F53;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x4E0B;&#x534A;&#x8EAB;&#x66B4;&#x9732;&#x7ED9;&#x522B;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x80FD;&#x8D8A;&#x53D1;&#x7684;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#x3002;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x7684;&#x9879;&#x76EE;&#x5F88;&#x51FA;&#x5F69;&#xFF0C;&#x4E5F;&#x80FD;&#x6B63;&#x9762;&#x7684;&#x4FC3;&#x8FDB;&#x81EA;&#x5DF1;&#x7EE7;&#x7EED;&#x5B8C;&#x5584;&#xFF0C;&#x505A;&#x5230;&#x66F4;&#x597D;&#x3002;</p>
</li>
<li><p>&#x5728;&#x6574;&#x4E2A;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9605;&#x8BFB;&#x4F18;&#x79C0;&#x6E90;&#x7801;&#x662F;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x7684;&#x63D0;&#x9AD8;&#x6280;&#x80FD;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x901A;&#x8FC7;&#x8BFB;&#x522B;&#x4EBA;&#x7684;&#x4F18;&#x79C0;&#x6E90;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x5230;&#x5B66;&#x4E60;&#x522B;&#x4EBA;&#x597D;&#x7684;&#x5F00;&#x53D1;&#x903B;&#x8F91;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x6846;&#x67B6;&#x77E5;&#x8BC6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5343;&#x4E07;&#x522B;&#x53EA;&#x4F1A;&#x7528;&#x8F6E;&#x5B50;&#xFF0C;&#x81EA;&#x5DF1;&#x5076;&#x5C14;&#x7684;&#x4E5F;&#x8981;&#x5C1D;&#x8BD5;&#x4E0B;&#x9020;&#x8F6E;&#x5B50;&#xFF0C;&#x6216;&#x8005;&#x8D77;&#x7801;&#x5F97;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x6240;&#x7528;&#x8F6E;&#x5B50;&#x7684;&#x539F;&#x7406;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x5728;&#x9762;&#x8BD5;&#x522B;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x5E38;&#x5E38;&#x4F1A;&#x95EE;&#x5230;&#x7684;&#x3002;</p>
</li>
<li><p>&#x5C3D;&#x7BA1;&#x5DE5;&#x4F5C;&#x82E6;&#x903C;&#x7E41;&#x5FD9;&#xFF0C;&#x5728;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x8FD8;&#x662F;&#x770B;&#x770B;&#x4E66;&#x6BD4;&#x8F83;&#x597D;&#x3002;&#x54EA;&#x6015;&#x4E0D;&#x662F;&#x6280;&#x672F;&#x7C7B;&#x7684;&#x4E66;&#xFF0C;&#x4E5F;&#x80FD;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x6240;&#x63D0;&#x5347;&#x7684;&#x3002;&#x524D;&#x4E00;&#x9635;&#x5B50;&#x91CD;&#x6E29;&#x4E86;&#x4E00;&#x904D;&#x4E4B;&#x524D;&#x770B;&#x7684;&#x4E66;&#xFF0C;&#x8FD8;&#x662F;&#x80FD;&#x591F;&#x6709;&#x65B0;&#x7684;&#x7406;&#x89E3;&#x8BA4;&#x8BC6;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x6709;&#x79CD;&#x600E;&#x4E48;&#x6CA1;&#x6709;&#x65E9;&#x8BFB;&#x5230;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x611F;&#x6168;&#x3002;</p>
</li>
<li><p>&#x6700;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x6280;&#x672F;&#x66F4;&#x65B0;&#x901F;&#x5EA6;&#x8FD8;&#x662F;&#x633A;&#x5FEB;&#x7684;&#xFF0C;&#x5E73;&#x65F6;&#x8FD8;&#x662F;&#x8981;&#x591A;&#x5173;&#x5FC3;&#x4E9B;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x3001;&#x65B0;&#x95FB;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x5728;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#x6280;&#x672F;&#x7CBE;&#x8FDB;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53BB;&#x4E86;&#x89E3;&#x5B66;&#x4E60;&#x4E0B;&#x5176;&#x4ED6;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x5168;&#x6808;&#xFF0C;&#x591A;&#x63A5;&#x89E6;&#x4E0B;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x5F00;&#x9614;&#x773C;&#x754C;&#x7684;&#x3002;</p>
</li>
</ul>
<h4 id="&#x6700;&#x540E;"><a href="#&#x6700;&#x540E;" class="headerlink" title="&#x6700;&#x540E;"></a>&#x6700;&#x540E;</h4><p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x5728; iOS &#x9886;&#x57DF;&#x6709;&#x4E00;&#x5B9A;&#x7814;&#x7A76;&#x7684;&#x4EBA;&#xFF0C;&#x963F;&#x91CC;&#x7684;&#x670B;&#x53CB;&#x6709;&#x5185;&#x63A8;&#x7684;&#x673A;&#x4F1A;&#x54E6;~ &#x7B80;&#x5386;&#x5C3D;&#x7BA1;&#x7838;&#x8FC7;&#x6765;&#x5427; <a href="yusheng.hs@alibaba-inc.com">yusheng.hs@alibaba-inc.com</a></p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x963F;&#x91CC;&#x6CA1;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8003;&#x8651;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#xFF08;&#x534A;&#x7CD6;&#x3001;&#x7701;&#x94B1;&#x5FEB;&#x62A5;&#xFF09;&#x54E6;~ &#x5185;&#x63A8;&#x90AE;&#x7BB1;&#x5949;&#x4E0A; <a href="mengliang@ibantang.com">mengliang@ibantang.com</a></p>


                <hr>

                

                <ul class="pager">
                    
                    
                        <li class="next">
                            <a href="/Roylee-ML.github.io/2016/08/04/Swift Method Swizzling/" data-toggle="tooltip" data-placement="top" title="Swift中使用Method Swizzling">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                

                

            </div>
    <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/Roylee-ML.github.io/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/Roylee-ML.github.io/tags/#阿里" title="阿里">阿里</a>
                        
                          <a class="tag" href="/Roylee-ML.github.io/tags/#面试" title="面试">面试</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="http://birdmichael.com/" target="_blank">BirdMichael&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>







<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("http://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;
            left: -0.75em;
            font-size: 1.1em;
            margin-top : -0.1em;
        }
    }
</style>




<!-- Gitalk 公共JS代码 start (一个网页只需插入一次) -->
    <link rel="stylesheet" href="https://unpkg.com/gitalk/dist/gitalk.css">
<div id="gitalk-container"></div>
<script src="https://unpkg.com/gitalk/dist/gitalk.min.js"></script>
<script type="text/javascript">
    var gitalk = new Gitalk({
        clientID: 'a09e7cc0e4b945f5e6d3',
        clientSecret: 'b99fba2d4ccc836f6ffb04e3194e96646b2bd11d',
        id: location.pathname,
        repo: 'blog-comments',
        owner: 'Roylee-ML',
        admin: 'Roylee-ML'
    })
    gitalk.render('gitalk-container')
</script>

<!-- Gitalk 公共JS代码 end -->



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/error408">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="https://www.facebook.com/roylee.stillway">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-facebook fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://github.com/Roylee-ML">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Roylee&#39;s Blog 2018 
                    <br>
                    Theme by <a href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a href="http://blog.kaijun.rocks">Kaijun</a> <!-- | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe> -->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->
<script src="/Roylee-ML.github.io/js/jquery.min.js"></script>

<!-- Bootstrap Core JavaScript -->
<script src="/Roylee-ML.github.io/js/bootstrap.min.js"></script>

<!-- Custom Theme JavaScript -->
<script src="/Roylee-ML.github.io/js/hux-blog.min.js"></script>


<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://error408.com/Roylee-ML.github.io/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '63fd5f0468edd7f1983edc897f814664';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->





<!-- Image to hack wechat -->
<img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0" />
<!-- Migrate from head to bottom, no longer block render and still work -->

</body>

</html>
