<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="A blog of roylee，一个半路出家的iOS Coder的技术之路">
    <meta name="keyword"  content="Personal blog，iOS，Developer，Coder，博客，iOS开发，技术">
    <link rel="shortcut icon" href="/Roylee-ML.github.io/img/favicon.ico">

    <title>
        
          有条线叫“一个像素” - Roylee Blog From A iOS Developer
        
    </title>

    <link rel="canonical" href="http://error408.com/Roylee-ML.github.io/2016/08/02/有条线叫“一个像素”/">

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/bootstrap.min.css">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/hux-blog.min.css">

    <!-- Pygments Github CSS -->
    <link rel="stylesheet" href="/Roylee-ML.github.io/css/syntax.css">

    <!-- Custom Fonts -->
    <!-- <link href="http://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="http://cdn.staticfile.org/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>

    <meta name="baidu-site-verification" content="zeyFn1s9OY" />
</head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/Roylee-ML.github.io/">Roylee&#39;s Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/Roylee-ML.github.io/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/Roylee-ML.github.io/tags/">Tags</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('http://blogsrc.error408.com/hexoblog/images/base/info-bg.jpg')
    }
</style>
<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                    </div>
                    <h1>有条线叫“一个像素”</h1>
                    <h2 class="subheading"></h2>
                    <span class="meta">
                        Posted by Roylee on
                        2016-08-02
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <p>&#x5728;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x7EBF;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;1&#x4E2A;&#x70B9;&#x7684;&#x7EBF;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x7EBF;&#x7684;&#x6548;&#x679C;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;</p>
<blockquote>
<p>1 Point&#x7684;&#x7EBF;&#x5728;&#x975E;Retina&#x5C4F;&#x5E55;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x5728;Retina&#x5C4F;&#x5E55;&#x4E0A;&#x5219;&#x53EF;&#x80FD;&#x662F;2&#x4E2A;&#x6216;&#x8005;3&#x4E2A;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x7CFB;&#x7EDF;&#x8BBE;&#x5907;&#x7684;PPI&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x662F;&#x60F3;&#x5230;&#xFF0C;&#x5728;&#x753B;&#x7EBF;&#x7684;&#x65F6;&#x5019;&#x901A;&#x5E38;&#x4F1A;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x6570;&#x503C;&#xFF1A;</p>
<pre><code>1.f/[UIScreen mainScreen].scale
</code></pre><p>&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8FD9;&#x6837;&#x5E76;&#x4E0D;&#x80FD;&#x8FBE;&#x5230;&#x60F3;&#x8981;&#x7684;&#x6548;&#x679C;&#x3002;&#x6700;&#x8FD1;&#x5728;&#x5199;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4FBF;&#x9047;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4E4B;&#x524D;&#xFF0C;&#x6709;&#x8FC7;&#x5370;&#x8C61;&#xFF0C;iOS&#x5728;&#x6E32;&#x67D3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x91C7;&#x7528;&#x5750;&#x6807;&#x6570;&#x503C;&#xFF0C;&#x5F53;&#x51FA;&#x73B0;&#x5C0F;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6240;&#x753B;&#x7684;&#x70B9;&#x4E5F;&#x8BB8;&#x5E76;&#x4E0D;&#x4F1A;&#x6070;&#x597D;&#x7684;&#x843D;&#x5230;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x4E0A;&#xFF0C;&#x4FBF;&#x4E0D;&#x80FD;&#x8FBE;&#x5230;&#x9884;&#x671F;&#x7684;&#x6548;&#x679C;&#x4E86;&#x3002;&#x8FD9;&#x6B21;&#xFF0C;&#x6B63;&#x597D;&#x5177;&#x4F53;&#x7684;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x50CF;&#x7D20;&#x753B;&#x7EBF;&#x7684;&#x95EE;&#x9898;</p>
<h4 id="&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x6E32;&#x67D3;&#x7684;&#xFF1F;"><a href="#&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x6E32;&#x67D3;&#x7684;&#xFF1F;" class="headerlink" title="&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x6E32;&#x67D3;&#x7684;&#xFF1F;"></a>&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x6E32;&#x67D3;&#x7684;&#xFF1F;</h4><p>&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x89C6;&#x56FE;&#x7684;frame&#x5E76;&#x4E0D;&#x662F;&#x6574;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7CFB;&#x7EDF;&#x5728;&#x6E32;&#x67D3;&#x65F6;&#x5019;&#x7531;&#x4E8E;&#x70B9;&#x7684;&#x6E32;&#x67D3;&#x5E76;&#x4E0D;&#x4F1A;&#x603B;&#x80FD;&#x843D;&#x5230;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x4E0A;&#xFF0C;&#x4F1A;&#x91C7;&#x7528;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x5904;&#x7406;&#x6765;&#x8FBE;&#x5230;&#x76F8;&#x5BF9;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<blockquote>
<ul>
<li>&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#xFF0C;&#x7ED8;&#x56FE;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x53EB;&#x201C;antialiasing(&#x53CD;&#x952F;&#x9F7F;)&#x201D;&#x7684;&#x6280;&#x672F;&#xFF0C;iOS&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</li>
<li>&#x663E;&#x793A;&#x5C4F;&#x5E55;&#x662F;&#x7531;&#x5F88;&#x591A;&#x5C0F;&#x7684;&#x663E;&#x793A;&#x5355;&#x5143;&#x7EC4;&#x6210;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x5C31;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x3002;&#x5982;&#x679C;&#x8981;&#x753B;&#x4E00;&#x6761;&#x9ED1;&#x7EBF;&#xFF0C;&#x7EBF;&#x521A;&#x597D;&#x843D;&#x5728;&#x4E86;&#x4E00;&#x5217;&#x6216;&#x8005;&#x4E00;&#x884C;&#x663E;&#x793A;&#x663E;&#x793A;&#x5355;&#x5143;&#x4E4B;&#x5185;&#xFF0C;&#x5C06;&#x4F1A;&#x6E32;&#x67D3;&#x51FA;&#x6807;&#x51C6;&#x7684;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x9ED1;&#x7EBF;&#x3002;&#x4F46;&#x5982;&#x679C;&#x7EBF;&#x843D;&#x5728;&#x4E86;&#x4E24;&#x4E2A;&#x884C;&#x6216;&#x5217;&#x7684;&#x4E2D;&#x95F4;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x6761;&#x201C;&#x5931;&#x771F;&#x201D;&#x7684;&#x7EBF;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x4E24;&#x4E2A;&#x50CF;&#x7D20;&#x5BBD;&#x7684;&#x7070;&#x7EBF;&#x3002;</li>
</ul>
</blockquote>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="http://blogsrc.error408.com/hexoblog/images/&#x6709;&#x6761;&#x7EBF;&#x53EB;&#x201C;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x201D;/pixel_line1.png" alt="Line"></p>
<p><strong>&#x6CE8;&#xFF1A;&#x753B;&#x7EBF;&#x901A;&#x5E38;&#x4F1A;&#x5728;<code>drawRect:</code>&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x753B;&#x7684;&#x7EBF;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x6307;&#x5B9A;&#x7684;&#x70B9;&#x5411;&#x5916;&#x5EF6;&#x4F38;&#xFF0C;&#x800C;&#x662F;&#x4EE5;&#x6307;&#x5B9A;&#x7684;&#x70B9;&#x4E3A;&#x7EBF;&#x7684;&#x4E2D;&#x5FC3;&#x5411;&#x4E24;&#x8FB9;&#x6E32;&#x67D3;&#x3002;&#x6240;&#x4EE5;&#x4FBF;&#x4F1A;&#x51FA;&#x73B0;&#x4E0A;&#x9762;&#x7684;&#x60C5;&#x51B5;&#xFF08;&#x6211;&#x4EEC;&#x753B;&#x7684;&#x50CF;&#x7D20;&#x500D;&#x6570;&#x7684;&#x70B9;&#x5C31;&#x662F;&#x843D;&#x5728;&#x4E0A;&#x56FE;&#x4E2D;&#x683C;&#x5B50;&#x7684;&#x5206;&#x5272;&#x7EBF;&#x4E0A;&#xFF09;</strong></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x753B;&#x7684;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x7EBF;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x5931;&#x771F;&#x7684;&#x539F;&#x56E0;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x5728;&#x753B;&#x7EBF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x6240;&#x753B;&#x7684;&#x70B9;&#x505A;&#x504F;&#x79FB;&#x5904;&#x7406;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="http://blogsrc.error408.com/hexoblog/images/&#x6709;&#x6761;&#x7EBF;&#x53EB;&#x201C;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x201D;/pixel_line2.png" alt="Line"></p>
<p>&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x7247;&#x4E2D;&#x6BCF;&#x4E00;&#x683C;&#x5B50;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x800C;&#x9876;&#x90E8;&#x6807;&#x8BB0;&#x7684;&#x5219;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x5E03;&#x5C40;&#x65F6;&#x7684;&#x5750;&#x6807;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5DE6;&#x8FB9;&#x7684;&#x975E;Retina&#x5C4F;&#x5E55;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5728;(3,0)&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x753B;&#x4E00;&#x6761;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x5BBD;&#x7684;&#x7AD6;&#x7EBF;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x6E32;&#x67D3;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x662F;&#x50CF;&#x7D20;&#xFF0C;&#x800C;(3,0)&#x8FD9;&#x4E2A;&#x5750;&#x6807;&#x6070;&#x597D;&#x4F4D;&#x4E8E;&#x4E24;&#x4E2A;&#x50CF;&#x7D20;&#x4E2D;&#x95F4;&#xFF0C;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x4F1A;&#x5BF9;&#x5750;&#x6807;3&#x5DE6;&#x53F3;&#x4E24;&#x5217;&#x7684;&#x50CF;&#x7D20;&#x586B;&#x5145;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x81F3;&#x4E8E;&#x7EBF;&#x663E;&#x5F97;&#x592A;&#x5BBD;&#xFF0C;&#x4E3A;&#x5BF9;&#x7EBF;&#x7684;&#x989C;&#x8272;&#x6DE1;&#x5316;&#x3002;&#x90A3;&#x4E48;&#x6839;&#x636E;&#x4E0A;&#x8FF0;&#x4FE1;&#x606F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x753B;&#x51FA;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x5BBD;&#x7684;&#x7EBF;&#xFF0C;&#x5C31;&#x5F97;&#x628A;&#x7ED8;&#x5236;&#x7684;&#x5750;&#x6807;&#x79FB;&#x52A8;&#x5230;(2.5, 0)&#x6216;&#x8005;(3.5,0)&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;&#x7CFB;&#x7EDF;&#x6E32;&#x67D3;&#x7684;&#x65F6;&#x5019;&#x521A;&#x597D;&#x53EF;&#x4EE5;&#x586B;&#x5145;&#x4E00;&#x5217;&#x50CF;&#x7D20;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6807;&#x51C6;&#x7684;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x7EBF;&#x3002;</p>
<blockquote>
<p>&#x90A3;&#x4E48;&#x7531;&#x6B64;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x6211;&#x4EEC;&#x753B;&#x7EBF;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x8981;&#x5728;&#x539F;&#x6709;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x505A;0.5&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x504F;&#x79FB;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;</p>
</blockquote>
<pre><code>(1.f/[UIScreen mainScreen].scale) / 2
</code></pre><h4 id="&#x89E3;&#x51B3;&#x50CF;&#x7D20;&#x504F;&#x5DEE;&#x95EE;&#x9898;"><a href="#&#x89E3;&#x51B3;&#x50CF;&#x7D20;&#x504F;&#x5DEE;&#x95EE;&#x9898;" class="headerlink" title="&#x89E3;&#x51B3;&#x50CF;&#x7D20;&#x504F;&#x5DEE;&#x95EE;&#x9898;"></a>&#x89E3;&#x51B3;&#x50CF;&#x7D20;&#x504F;&#x5DEE;&#x95EE;&#x9898;</h4><p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;<strong>&#x5BF9;&#x7EBF;&#x7684;&#x4F4D;&#x7F6E;&#x505A;0.5&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x4F4D;&#x79FB;&#x5904;&#x7406;</strong>&#x3002;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5728;&#x6574;&#x6570;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x753B;&#x7EBF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x4EE5;&#x4E0B;&#x5904;&#x7406;:<br></p>
<pre><code>CGFloat CGFloatPixelRound(CGFloat value) {
   CGFloat scale = [UIScreen mainScreen].scale;
   return round(value * scale) / scale;
}
</code></pre><blockquote>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x6211;&#x4EEC;&#x753B;&#x7EBF;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x505A;<code>round()</code>&#x6216;&#x8005;<code>ceil()</code>&#x7684;&#x53D6;&#x6574;&#x5904;&#x7406;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x5BF9;&#x7EBF;&#x7684;&#x4F4D;&#x7F6E;&#x505A;&#x504F;&#x79FB;&#x5904;&#x7406;</p>
</blockquote>
<p>&#x5E76;&#x4E14;&#xFF0C;&#x5B9E;&#x9645;&#x4E2D;&#x4F1A;&#x51FA;&#x73B0;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<ol>
<li><p>&#x5982;&#x679C;&#x5728;<code>drawRect:</code>&#x65B9;&#x6CD5;&#x4E2D;&#x81EA;&#x5DF1;&#x753B;&#x7EBF;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x7EBF;&#x7684;&#x5750;&#x6807;&#x505A;&#x50CF;&#x7D20;&#x53D6;&#x6574;&#x5904;&#x7406;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x505A;0.5&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x504F;&#x79FB;</p>
</li>
<li><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;view&#x6765;&#x4F5C;&#x4E3A;&#x7EBF;&#x4F7F;&#x7528;&#x7684;&#x8BDD;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x50CF;&#x7D20;&#x504F;&#x79FB;&#x7684;&#x5904;&#x7406;&#x3002;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x7EBF;&#x7684;&#x8D77;&#x70B9;&#x5750;&#x6807;&#x505A;&#x50CF;&#x7D20;&#x53D6;&#x6574;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x56E0;&#x4E3A;view&#x7531;&#x8D77;&#x70B9;&#x5411;&#x5916;&#x6E32;&#x67D3;&#xFF0C;&#x800C;&#x753B;&#x7EBF;&#x5219;&#x662F;&#x4EE5;&#x6307;&#x5B9A;&#x7684;&#x70B9;&#x4E3A;&#x4E2D;&#x5FC3;&#x5411;&#x4E24;&#x8FB9;&#x6E32;&#x67D3;</p>
</li>
</ol>
<p>&#x540C;&#x65F6;&#xFF0C;&#x4E0A;&#x9762;&#x5BF9;point&#x7684;&#x70B9;&#x7684;&#x50CF;&#x7D20;&#x53D6;&#x6574;&#x64CD;&#x4F5C;&#x5728;&#x5E73;&#x65F6;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#x5904;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x6240;&#x5EFA;&#x89C6;&#x56FE;&#x7684;&#x4F4D;&#x7F6E;&#x5927;&#x5C0F;&#x6070;&#x597D;&#x4E3A;&#x6574;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x53EF;&#x4EE5;&#x5BF9;&#x89C6;&#x56FE;&#x7684;&#x4F4D;&#x7F6E;&#x5927;&#x5C0F;&#x505A;&#x4E0A;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<blockquote>
<p>&#x6BD4;&#x8F83;&#x5E38;&#x51FA;&#x73B0;&#x7684;&#x4E00;&#x79CD;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF1A;&#x5728;&#x6EDA;&#x52A8;&#x89C6;&#x56FE;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x89C6;&#x56FE;&#x7684;frame&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x6839;&#x636E;&#x5C4F;&#x5E55;&#x5C3A;&#x5BF8;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x5076;&#x5C14;&#x4F1A;&#x5728;&#x89C6;&#x56FE;&#x7684;&#x6EDA;&#x52A8;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x89C6;&#x56FE;&#x8FB9;&#x7F18;&#x51FA;&#x73B0;&#x95EA;&#x70C1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E0A;&#x4E0B;&#x4E24;&#x4E2A;&#x89C6;&#x56FE;&#x91CD;&#x53E0;&#x7684;&#x65F6;&#x5019;&#x3002;&#xFF08;&#x8FD9;&#x5C31;&#x662F;&#x5C4F;&#x5E55;&#x6E32;&#x67D3;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x6EDA;&#x52A8;&#x524D;&#x540E;&#x50CF;&#x7D20;&#x5DEE;&#x522B;&#x7684;&#x95EE;&#x9898;&#xFF09; </p>
</blockquote>
<p>&#x4EE5;&#x4E0A;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x600E;&#x4E48;&#x505A;&#x51FA;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x7EBF;&#x7684;&#x603B;&#x7ED3;&#x3002;</p>
<p><a href="https://developer.apple.com/library/ios/documentation/2DDrawing/Conceptual/DrawingPrintingiOS/GraphicsDrawingOverview/GraphicsDrawingOverview.html" target="_blank" rel="external">&#x5B98;&#x65B9;&#x8D44;&#x6599;</a></p>


                <hr>

                

                <ul class="pager">
                    
                        <li class="previous">
                            <a href="/Roylee-ML.github.io/2016/08/03/Prisma-成功的不只是艺术/" data-toggle="tooltip" data-placement="top" title="Prisma--成功的不只是艺术">&larr; Previous Post</a>
                        </li>
                    
                    
                        <li class="next">
                            <a href="/Roylee-ML.github.io/2016/08/02/Hexo七牛图床使用/" data-toggle="tooltip" data-placement="top" title="Hexo七牛图床使用">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                

                

            </div>
    <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/Roylee-ML.github.io/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="http://birdmichael.com/" target="_blank">BirdMichael&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>







<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("http://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;
            left: -0.75em;
            font-size: 1.1em;
            margin-top : -0.1em;
        }
    }
</style>




<!-- Gitalk 公共JS代码 start (一个网页只需插入一次) -->
    <link rel="stylesheet" href="https://unpkg.com/gitalk/dist/gitalk.css">
<div id="gitalk-container"></div>
<script src="https://unpkg.com/gitalk/dist/gitalk.min.js"></script>
<script type="text/javascript">
    var gitalk = new Gitalk({
        clientID: 'a09e7cc0e4b945f5e6d3',
        clientSecret: 'b99fba2d4ccc836f6ffb04e3194e96646b2bd11d',
        id: location.pathname,
        repo: 'blog-comments',
        owner: 'Roylee-ML',
        admin: 'Roylee-ML'
    })
    gitalk.render('gitalk-container')
</script>

<!-- Gitalk 公共JS代码 end -->



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/error408">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="https://www.facebook.com/roylee.stillway">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-facebook fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://github.com/Roylee-ML">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Roylee&#39;s Blog 2018 
                    <br>
                    Theme by <a href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a href="http://blog.kaijun.rocks">Kaijun</a> <!-- | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe> -->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->
<script src="/Roylee-ML.github.io/js/jquery.min.js"></script>

<!-- Bootstrap Core JavaScript -->
<script src="/Roylee-ML.github.io/js/bootstrap.min.js"></script>

<!-- Custom Theme JavaScript -->
<script src="/Roylee-ML.github.io/js/hux-blog.min.js"></script>


<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://error408.com/Roylee-ML.github.io/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '63fd5f0468edd7f1983edc897f814664';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->





<!-- Image to hack wechat -->
<img src="http://error408.com/Roylee-ML.github.io/img/icon_wechat.png" width="0" height="0" />
<!-- Migrate from head to bottom, no longer block render and still work -->

</body>

</html>
